{
    "questions" : [
        {
            "type" : "multiple-YesNo",
            "question" : "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation" : "As edições de licença do Azure Active Directory (Azure AD) variam em termos de recursos oferecidos; portanto, nem todas incluem os mesmos recursos. Você pode gerenciar um locatário do Azure AD usando o portal do Azure, que fornece uma interface baseada na web para administração. Além disso, não é necessário implantar máquinas virtuais Azure para hospedar um locatário do Azure AD, pois o Azure AD é um serviço de identidade baseado em nuvem.",
            "statements" : [
                {
                    "title" : "Todas as edições de licença do Azure Active Directory (Azure AD) incluem os mesmos recursos",
                    "isCorrect" : false
                },
                {
                    "title" : "Você pode gerenciar um locatário do Azure Active Directory (Azure AD) usando o portal do Azure.",
                    "isCorrect" : true
                },
                {
                    "title" : "Você deve implantar máquinas virtuais Azure para hospedar um locatário do Azure Active Directory (Azure AD).",
                    "isCorrect" : false
                }
            ]
        },
        {
            "type" : "select",
            "question" : "Selecione a resposta que completa corretamente a frase: ...fornece melhores práticas de funcionários, parceiros e clientes da Microsoft, incluindo ferramentas e orientações para auxiliar na implantação do Azure.",
            "explanation" : "O Azure Policy garante que os recursos em seu ambiente Azure estejam em conformidade com as regras e padrões definidos por sua organização. Ele fornece diretrizes de funcionários, parceiros e clientes da Microsoft, juntamente com ferramentas para auxiliar na implantação e gerenciamento de seus recursos de forma eficaz.",
            "statements" : [
                {
                    "title" : "Azure Blueprints",
                    "isCorrect" : false
                },
                {
                    "title" : "Azure Policy",
                    "isCorrect" : false
                },
                {
                    "title" : "O Microsoft Cloud Adoption Framework para Azure",
                    "isCorrect" : true
                },
                {
                    "title" : "Um bloqueio de recurso",
                    "isCorrect" : false
                }
            ]
        },
        {
            "type": "select",
            "question": "...é usado para identificar, manter e exportar informações eletrônicas que podem ser usadas em uma investigação.",
            "explanation": "eDiscovery (Descoberta Eletrônica) é usado para identificar, manter e exportar informações eletrônicas que podem ser usadas em uma investigação legal. Ele permite que as organizações encontrem e preservem dados relevantes armazenados em várias fontes, como emails e documentos, para fins de conformidade e litígio.",
            "statements": [
                {
                    "title": "Customer Lockbox",
                    "isCorrect": false
                },
                {
                    "title": "Prevenção contra perda de dados (DLP)",
                    "isCorrect": false
                },
                {
                    "title": "eDiscovery",
                    "isCorrect": true
                },
                {
                    "title": "Um bloqueio de recurso",
                    "isCorrect": false
                }
            ]
        },        
        {
            "type": "select",
            "question": "Você pode gerenciar o Microsoft Intune usando o...",
            "explanation": "O centro de administração do Microsoft Endpoint Manager é o portal principal para gerenciar o Microsoft Intune. Ele fornece uma interface centralizada para configurar políticas de dispositivos, aplicativos e muito mais, facilitando a administração e segurança dos dispositivos gerenciados.",
            "statements": [
                {
                    "title": "Centro de administração do Azure Active Directory.",
                    "isCorrect": false
                },
                {
                    "title": "Centro de conformidade do Microsoft 365.",
                    "isCorrect": false
                },
                {
                    "title": "Portal do Microsoft 365 Defender.",
                    "isCorrect": false
                },
                {
                    "title": "Centro de administração do Microsoft Endpoint Manager.",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "select",
            "question": "A federação é usada para estabelecer ... entre organizações.",
            "explanation": "A federação é usada para estabelecer uma relação de confiança entre organizações. Isso permite que usuários em uma organização acessem recursos em outra organização sem a necessidade de múltiplas autenticações, facilitando o acesso seguro e conveniente aos serviços.",
            "statements": [
                {
                    "title": "autenticação multifator (MFA)",
                    "isCorrect": false
                },
                {
                    "title": "uma relação de confiança",
                    "isCorrect": true
                },
                {
                    "title": "sincronização de contas de usuário",
                    "isCorrect": false
                },
                {
                    "title": "uma conexão VPN",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "Aplicar atualizações do sistema, avaliar recursos em várias assinaturas do Azure e habilitar a autenticação multifator (MFA) são ações que aumentam a pontuação de segurança de uma organização no Microsoft Defender for Cloud. Isso porque essas ações ajudam a melhorar a postura de segurança e a proteger os recursos da organização.",
            "statements": [
                {
                    "title": "Aplicar atualizações do sistema aumenta a pontuação de segurança de uma organização no Microsoft Defender for Cloud.",
                    "isCorrect": true
                },
                {
                    "title": "A pontuação de segurança no Microsoft Defender for Cloud pode avaliar recursos em várias assinaturas do Azure.",
                    "isCorrect": true
                },
                {
                    "title": "Habilitar a autenticação multifator (MFA) aumenta a pontuação de segurança de uma organização no Microsoft Defender for Cloud.",
                    "isCorrect": true
                }
            ]
        },        
        {
            "type": "select",
            "question": "Qual pontuação mede o progresso de uma organização na conclusão de ações que ajudam a reduzir riscos associados à proteção de dados e padrões regulatórios?",
            "explanation": "O Compliance score mede o progresso de uma organização na conclusão de ações que ajudam a reduzir os riscos associados à proteção de dados e aos padrões regulatórios. Ele fornece uma avaliação detalhada de como a organização está aderindo aos requisitos de conformidade.",
            "statements": [
                {
                    "title": "Microsoft Secure Score",
                    "isCorrect": false
                },
                {
                    "title": "Compliance score",
                    "isCorrect": true
                },
                {
                    "title": "Productivity Score",
                    "isCorrect": false
                },
                {
                    "title": "Secure score in Azure Security Center",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "select",
            "question": "O que você usa para fornecer integração em tempo real entre o Azure Sentinel e outra fonte de segurança?",
            "explanation": "Para fornecer integração em tempo real entre o Azure Sentinel e outra fonte de segurança, você utiliza um 'conector'. Os conectores permitem que o Azure Sentinel se conecte a várias fontes de dados para ingestão de dados de segurança em tempo real, facilitando a monitorização e detecção de ameaças.",
            "statements": [
                {
                    "title": "Azure AD Connect",
                    "isCorrect": false
                },
                {
                    "title": "um workspace do Log Analytics",
                    "isCorrect": false
                },
                {
                    "title": "Azure Information Protection",
                    "isCorrect": false
                },
                {
                    "title": "um conector",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "choose",
            "question": "Qual portal da Microsoft fornece informações sobre como os serviços de nuvem da Microsoft cumprem com os padrões regulatórios, como a International Organization for Standardization (ISO)?",
            "explanation": "O Microsoft Service Trust Portal fornece informações sobre como os serviços de nuvem da Microsoft cumprem com os padrões regulatórios, incluindo os da International Organization for Standardization (ISO).",
            "statements": [
                {
                    "title": "o centro de administração do Microsoft Endpoint Manager",
                    "isCorrect": false
                },
                {
                    "title": "Azure Cost Management + Billing",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Service Trust Portal",
                    "isCorrect": true
                },
                {
                    "title": "o centro de administração do Azure Active Directory",
                    "isCorrect": false
                }
            ]
        },        
        {
            "type": "select",
            "question": "Qual responsabilidade compartilhada em uma implantação do Azure é de responsabilidade exclusiva da Microsoft?",
            "explanation": "Na implantação do Azure, a Microsoft é exclusivamente responsável pelo gerenciamento do hardware físico. Isso inclui a manutenção e operação dos servidores e outros equipamentos de infraestrutura.",
            "statements": [
                {
                    "title": "o gerenciamento de dispositivos móveis",
                    "isCorrect": false
                },
                {
                    "title": "as permissões para os dados do usuário armazenados no Azure",
                    "isCorrect": false
                },
                {
                    "title": "a criação e gestão de contas de usuário",
                    "isCorrect": false
                },
                {
                    "title": "o gerenciamento do hardware físico",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "Os princípios do modelo de segurança Zero Trust incluem 'Verificar explicitamente' e 'Assumir violação', o que implica que nenhuma rede é inerentemente segura e que todas as identidades, dispositivos e serviços devem ser autenticados e autorizados de forma contínua. O modelo não assume que um firewall assegura a rede interna contra ameaças externas.",
            "statements": [
                {
                    "title": "Verificar explicitamente é um dos princípios orientadores do Zero Trust.",
                    "isCorrect": true
                },
                {
                    "title": "Assumir violação é um dos princípios orientadores do Zero Trust.",
                    "isCorrect": true
                },
                {
                    "title": "O modelo de segurança Zero Trust assume que um firewall assegura a rede interna contra ameaças externas.",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "Os princípios de privacidade da Microsoft incluem controle e transparência. Controle se refere à capacidade dos usuários de gerenciar seus dados pessoais. Transparência envolve a clareza sobre como os dados são coletados e usados. A responsabilidade compartilhada, embora importante, não é considerada um princípio de privacidade principal da Microsoft.",
            "statements": [
                {
                    "title": "Controle é um princípio fundamental de privacidade da Microsoft.",
                    "isCorrect": true
                },
                {
                    "title": "Transparência é um princípio fundamental de privacidade da Microsoft.",
                    "isCorrect": true
                },
                {
                    "title": "Responsabilidade compartilhada é um princípio fundamental de privacidade da Microsoft.",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "select",
            "question": "... Um arquivo torna os dados no arquivo legíveis e utilizáveis para visualizadores que possuem a chave apropriada.",
            "explanation": "A questão diz 'para visualizadores que possuem a chave apropriada'. Então, a palavra-chave é 'CHAVE'. A criptografia é um meio de proteger dados digitais usando uma ou mais técnicas matemáticas, junto com uma senha ou 'chave' usada para descriptografar a informação. A descriptografia é um processo que transforma informações criptografadas em seu formato original. Para fazer isso, as partes de uma conversa privada usam um esquema de criptografia, chamado de algoritmo, e as chaves para criptografar e descriptografar mensagens.",
            "statements": [
                {
                    "title": "Arquivamento",
                    "isCorrect": false
                },
                {
                    "title": "Criptografando",
                    "isCorrect": true
                },
                {
                    "title": "Compactando",
                    "isCorrect": false
                },
                {
                    "title": "Desduplicando",
                    "isCorrect": false
                }
            ]
        },        
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "Box 1: Sim - É necessário um certificado que forneça uma chave privada e uma chave pública. Box 2: Sim - A chave pública é usada para validar a chave privada associada a uma assinatura digital. Box 3: Não - Como a chave privada é usada (e possuída) apenas pelo signatário para assinar o documento, e a chave pública associada é usada para verificar a autenticidade.",
            "statements": [
                {
                    "title": "Assinar digitalmente um documento requer uma chave privada.",
                    "isCorrect": true
                },
                {
                    "title": "Verificar a autenticidade de um documento assinado digitalmente requer a chave pública do signatário.",
                    "isCorrect": true
                },
                {
                    "title": "Verificar a autenticidade de um documento assinado digitalmente requer a chave privada do signatário.",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "select",
            "question": "Quando os usuários fazem login no portal do Azure, eles primeiro...",
            "explanation": "Autenticação é quem você diz que é. Autorização é a permissão que você tem.",
            "statements": [
                {
                    "title": "recebem permissões.",
                    "isCorrect": false
                },
                {
                    "title": "são autenticados.",
                    "isCorrect": true
                },
                {
                    "title": "são autorizados.",
                    "isCorrect": false
                },
                {
                    "title": "são resolvidos.",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "select",
            "question": "________ é o processo de identificar se um usuário conectado pode acessar um recurso específico.",
            "explanation": "A autorização é o processo de fornecer acesso a dados seguros.",
            "statements": [
                {
                    "title": "Autenticação",
                    "isCorrect": false
                },
                {
                    "title": "Autorização",
                    "isCorrect": true
                },
                {
                    "title": "Identificação",
                    "isCorrect": false
                },
                {
                    "title": "Verificação",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "select",
            "question": "...permite a colaboração com parceiros comerciais de organizações externas, como fornecedores, parceiros e prestadores de serviços. Usuários externos aparecem como usuários convidados no diretório.",
            "explanation": "A colaboração business-to-business (B2B) do Azure Active Directory (Azure AD) é um recurso dentro das Identidades Externas que permite convidar usuários convidados para colaborar com sua organização. Com a colaboração B2B, você pode compartilhar com segurança as aplicações e serviços da sua empresa com usuários convidados de qualquer outra organização, enquanto mantém o controle sobre seus próprios dados corporativos.",
            "statements": [
                {
                    "title": "Serviços de Domínio Active Directory (AD DS)",
                    "isCorrect": false
                },
                {
                    "title": "Colaboração business-to-business (B2B) do Azure Active Directory (Azure AD)",
                    "isCorrect": true
                },
                {
                    "title": "Confiança de floresta do Active Directory",
                    "isCorrect": false
                },
                {
                    "title": "Business-to-consumer (B2C) do Azure Active Directory (Azure AD B2C)",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "choose",
            "question": "Quais duas fases são abordadas antes da fase Ready?",
            "explanation": "Planejar e Definir Estratégia",
            "statements": [
                {
                    "title": "Planejar",
                    "isCorrect": true
                },
                {
                    "title": "Gerenciar",
                    "isCorrect": false
                },
                {
                    "title": "Adotar",
                    "isCorrect": false
                },
                {
                    "title": "Governar",
                    "isCorrect": false
                },
                {
                    "title": "Definir Estratégia",
                    "isCorrect": true
                }
            ]
        },        
        {
            "type": "multipleYesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "As respostas corretas são 'Não, Sim, Sim' (NYY). Gerenciar a rede física é responsabilidade da Microsoft (o provedor de nuvem). Você pode encontrar mais detalhes na documentação de responsabilidade compartilhada da Microsoft. Se a afirmação mencionasse 'controles de rede', a responsabilidade seria do cliente. Isso divide as responsabilidades para SaaS, IaaS e outros serviços em nuvem, indicando quais tarefas são gerenciadas pelo provedor de nuvem e quais pela organização.",
            "statements": [
                {
                    "title": "Em software como serviço (SaaS), aplicar pacotes de serviço a aplicativos é responsabilidade da organização.",
                    "isCorrect": false
                },
                {
                    "title": "Em infraestrutura como serviço (IaaS), gerenciar a rede física é responsabilidade do provedor de nuvem.",
                    "isCorrect": true
                },
                {
                    "title": "Em todos os tipos de implantação de nuvem do Azure, gerenciar a segurança das informações e dados é responsabilidade da organização.",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "multipleYesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "O Azure AD Connect pode ser usado para implementar identidade híbrida. Identidade híbrida requer a implementação de dois tenants do Microsoft 365. A autenticação de identidades híbridas requer a sincronização dos Serviços de Domínio do Active Directory (AD DS) e do Azure Active Directory (Azure AD).",
            "statements": [
                {
                    "title": "O Azure AD Connect pode ser usado para implementar identidade híbrida.",
                    "isCorrect": true
                },
                {
                    "title": "Identidade híbrida requer a implementação de dois tenants do Microsoft 365.",
                    "isCorrect": false
                },
                {
                    "title": "A autenticação de identidades híbridas requer a sincronização dos Serviços de Domínio do Active Directory (AD DS) e do Azure Active Directory (Azure AD).",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "select",
            "question": "fornece recomendações de benchmark e orientações para proteger os serviços do Azure.",
            "explanation": "As bases de segurança para o Azure ajudam a fortalecer a segurança através de ferramentas, monitoramento e recursos de segurança aprimorados. Elas também fornecem uma experiência consistente ao proteger seu ambiente.",
            "statements": [
                {
                    "title": "Azure Application Insights",
                    "isCorrect": false
                },
                {
                    "title": "Azure Network Watcher",
                    "isCorrect": false
                },
                {
                    "title": "Workspaces do Log Analytics",
                    "isCorrect": false
                },
                {
                    "title": "Bases de segurança para o Azure",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "choose",
            "question": "Qual é um exemplo de criptografia em repouso?",
            "explanation": "Criptografia em repouso refere-se à criptografia dos dados quando estão armazenados em um disco. Criptografar um disco de máquina virtual é um exemplo disso, garantindo que os dados permaneçam protegidos, mesmo quando não estão sendo usados ativamente.",
            "statements": [
                {
                    "title": "Criptografar comunicações usando uma VPN site-a-site",
                    "isCorrect": false
                },
                {
                    "title": "Criptografar um disco de máquina virtual",
                    "isCorrect": true
                },
                {
                    "title": "Acessar um site usando uma conexão HTTPS criptografada",
                    "isCorrect": false
                },
                {
                    "title": "Enviar um email criptografado",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "choose",
            "question": "Quais três afirmações descrevem com precisão os princípios orientadores do Zero Trust? Cada resposta correta apresenta uma solução completa.",
            "explanation": "Zero Trust é uma estratégia de segurança. Não é um produto ou serviço, mas uma abordagem no design e implementação do seguinte conjunto de princípios de segurança: Verificar explicitamente, Usar acesso de menor privilégio, Assumir violação.",
            "statements": [
                {
                    "title": "Definir o perímetro por localizações físicas.",
                    "isCorrect": false
                },
                {
                    "title": "Usar identidade como o principal limite de segurança.",
                    "isCorrect": true
                },
                {
                    "title": "Sempre verificar explicitamente as permissões de um usuário.",
                    "isCorrect": true
                },
                {
                    "title": "Sempre assumir que o sistema do usuário pode ser violado.",
                    "isCorrect": true
                },
                {
                    "title": "Usar a rede como o principal limite de segurança.",
                    "isCorrect": false
                }
            ]
        },        
        {
            "type": "multiple-select",
            "question": [
                "Criptografar dados em repouso",
                "Realizar uma auditoria de acesso ao sistema",
                "Fazer alterações de configuração em resposta a um incidente de segurança"
            ],            
            "explanation": "Box 1: Preventiva - As ações preventivas abordam riscos específicos. Por exemplo, proteger informações em repouso usando criptografia é uma ação preventiva contra ataques e violações. A separação de funções é uma ação preventiva para gerenciar conflitos de interesse e prevenir fraudes.\n\nBox 2: Detectiva - As ações detectivas monitoram ativamente os sistemas para identificar condições ou comportamentos irregulares que representam risco, ou que podem ser usados para detectar intrusões ou violações. Exemplos incluem auditoria de acesso ao sistema e ações administrativas privilegiadas. Auditorias de conformidade regulatória são um tipo de ação detectiva usada para encontrar problemas de processo.\n\nBox 3: Corretiva - As ações corretivas tentam manter os efeitos adversos de um incidente de segurança no mínimo, tomar medidas corretivas para reduzir o efeito imediato e reverter os danos, se possível. A resposta a incidentes de privacidade é uma ação corretiva para limitar danos e restaurar sistemas a um estado operacional após uma violação.",
            "statements": [
                {
                    "title": "Corretiva",
                    "isCorrect": true
                },
                {
                    "title": "Detectiva",
                    "isCorrect": true
                },
                {
                    "title": "Preventiva",
                    "isCorrect": true
                }
            ],
            "answers": [
                "Preventiva",
                "Detectiva",
                "Corretiva"
            ]
        },
        {
            "type": "select",
            "question": "O Compliance Manager pode ser acessado diretamente a partir do",
            "explanation": "O Centro de Conformidade agora é conhecido como Microsoft Purview.\n\nFazer login no Compliance Manager -\n\n1. Acesse o portal de conformidade Microsoft Purview e faça login com sua conta de administrador global do Microsoft 365.\n\n2. Selecione Compliance Manager no painel de navegação à esquerda. Você chegará ao seu painel do Compliance Manager.\n\nO link direto para acessar o Compliance Manager é https://compliance.microsoft.com/compliancemanager.\n\nNota: A conformidade do Microsoft 365 agora é chamada de Microsoft Purview, e as soluções dentro da área de conformidade foram renomeadas.\n\nReferência:\n\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/compliance-manager-setup",
            "statements": [
                {
                    "title": "Centro de administração do Microsoft 365",
                    "isCorrect": false
                },
                {
                    "title": "Centro de Conformidade do Microsoft 365",
                    "isCorrect": true
                },
                {
                    "title": "Portal do Microsoft 365 Defender",
                    "isCorrect": false
                },
                {
                    "title": "Portal de Suporte da Microsoft",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Habilitar a autenticação multifator (MFA) aumenta a Microsoft Secure Score.",
                    "isCorrect": true
                },
                {
                    "title": "Uma pontuação Microsoft Secure Score mais alta significa um nível de risco identificado mais baixo no tenant do Microsoft 365.",
                    "isCorrect": true
                },
                {
                    "title": "O Microsoft Secure Score mede o progresso na conclusão de ações com base em controles que incluem regulamentações e padrões importantes para a proteção e governança de dados.",
                    "isCorrect": false
                }
            ],
            "explanation": "Box 1: Sim - O Microsoft Secure Score atualizou ações de melhoria para suportar padrões de segurança no Azure Active Directory, o que torna mais fácil proteger sua organização com configurações de segurança pré-configuradas para ataques comuns.\n\nSe você ativar os padrões de segurança, receberá pontos completos pelas seguintes ações de melhoria:\n\nGarantir que todos os usuários possam concluir a autenticação multifator para acesso seguro (9 pontos)\n\nExigir MFA para funções administrativas (10 pontos)\n\nHabilitar política para bloquear autenticação legada (7 pontos)\n\nBox 2: Sim - Cada ação de melhoria vale 10 pontos ou menos, e a maioria é pontuada de forma binária. Se você implementar a ação de melhoria, como criar uma nova política ou ativar uma configuração específica, você recebe 100% dos pontos. Para outras ações de melhoria, os pontos são dados como uma porcentagem da configuração total.\n\nNota: Seguir as recomendações do Secure Score pode proteger sua organização contra ameaças. A partir de um painel centralizado no portal do Microsoft 365 Defender, as organizações podem monitorar e trabalhar na segurança das identidades, aplicativos e dispositivos do Microsoft 365.\n\nBox 3: Não - O Compliance Manager dá a você uma pontuação inicial com base na linha de base de proteção de dados do Microsoft 365. Essa linha de base é um conjunto de controles que inclui regulamentações e padrões importantes para a proteção e governança geral de dados. Essa linha de base se baseia principalmente no NIST CSF (National Institute of Standards and Technology Cybersecurity Framework) e na ISO (International Organization for Standardization), bem como no FedRAMP (Federal Risk and Authorization Management Program) e no GDPR (Regulamento Geral de Proteção de Dados da União Europeia)."
        },        
        {
            "type": "choose",
            "question": "O que você pode usar para fornecer a um usuário uma janela de duas horas para concluir uma tarefa administrativa no Azure?",
            "statements": [
                {
                    "title": "Azure Multi-Factor Authentication (MFA)",
                    "isCorrect": false
                },
                {
                    "title": "Azure Active Directory (Azure AD) Privileged Identity Management (PIM)",
                    "isCorrect": true
                },
                {
                    "title": "Azure Active Directory (Azure AD) Identity Protection",
                    "isCorrect": false
                },
                {
                    "title": "Políticas de acesso condicional",
                    "isCorrect": false
                }
            ],
            "explanation": "https://docs.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-configure\n\nO Privileged Identity Management fornece ativação de função baseada em tempo e aprovação para mitigar os riscos de permissões de acesso excessivas, desnecessárias ou mal utilizadas em recursos importantes. Aqui estão alguns dos principais recursos do Privileged Identity Management:\n\n- Fornecer acesso privilegiado just-in-time ao Azure AD e recursos do Azure\n\n- Atribuir acesso com limite de tempo aos recursos usando datas de início e término\n\n- Requerer aprovação para ativar funções privilegiadas\n\n- Aplicar autenticação multifator para ativar qualquer função\n\n- Usar justificativa para entender por que os usuários ativam\n\n- Receber notificações quando funções privilegiadas são ativadas\n\n- Conduzir revisões de acesso para garantir que os usuários ainda precisem das funções\n\n- Baixar histórico de auditoria para auditoria interna ou externa\n\n- Impedir a remoção da última atribuição de função de Administrador Global ativo"
        },
        {
            "type": "select",
            "question": "O que pode ser usado para sincronizar identidades entre AD DS e Azure AD?",
            "statements": [
                {
                    "title": "Serviços de Federação do Active Directory (AD FS)",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Sentinel",
                    "isCorrect": false
                },
                {
                    "title": "Azure AD Connect",
                    "isCorrect": true
                },
                {
                    "title": "Azure AD Privileged Identity Management (PIM)",
                    "isCorrect": false
                }
            ],
            "explanation": "Servidor de sincronização do Azure AD Connect. Referência: https://docs.microsoft.com/en-us/azure/active-directory/hybrid/whatis-azure-ad-connect"
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Você pode criar funções personalizadas no Azure Active Directory (Azure AD).",
                    "isCorrect": true
                },
                {
                    "title": "Administrador global é uma função no Azure Active Directory (Azure AD).",
                    "isCorrect": true
                },
                {
                    "title": "Um usuário do Azure Active Directory (Azure AD) pode ser atribuído a apenas uma função.",
                    "isCorrect": false
                }
            ],
            "explanation": "Box 1: Sim - O Azure AD suporta funções personalizadas.\nBox 2: Sim - O Administrador Global tem acesso a todos os recursos administrativos no Azure Active Directory.\nBox 3: Não - Um usuário do Azure AD pode ser atribuído a várias funções."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Azure Active Directory (Azure AD) é implantado em um ambiente local.",
                    "isCorrect": false
                },
                {
                    "title": "O Azure Active Directory (Azure AD) é fornecido como parte de uma assinatura do Microsoft 365.",
                    "isCorrect": true
                },
                {
                    "title": "O Azure Active Directory (Azure AD) é um serviço de gerenciamento de identidade e acesso.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Não - O Azure Active Directory (Azure AD) é um serviço de identidade e autenticação de usuário baseado em nuvem.\nBox 2: Sim - O Microsoft 365 usa o Azure Active Directory (Azure AD). O Azure Active Directory (Azure AD) está incluído na sua assinatura do Microsoft 365.\nBox 3: Sim - O Azure Active Directory (Azure AD) é um serviço de identidade e autenticação de usuário baseado em nuvem."
        },
        {
            "type": "select",
            "question": "Onde os dados biométricos de um usuário usados para autenticação são armazenados?",
            "explanation": "Os modelos biométricos são armazenados localmente em um dispositivo.",
            "statements": [
                {
                    "title": "são armazenados em um dispositivo externo.",
                    "isCorrect": false
                },
                {
                    "title": "são armazenados apenas em um dispositivo local.",
                    "isCorrect": true
                },
                {
                    "title": "são armazenados no Azure Active Directory (Azure AD).",
                    "isCorrect": false
                },
                {
                    "title": "são replicados para todos os dispositivos designados pelo usuário.",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "choose",
            "question": "Qual é o propósito da Proteção de Senha do Azure Active Directory (Azure AD)?",
            "statements": [
                {
                    "title": "controlar com que frequência os usuários devem alterar suas senhas",
                    "isCorrect": false
                },
                {
                    "title": "identificar dispositivos nos quais os usuários podem fazer login sem usar a autenticação multifator (MFA)",
                    "isCorrect": false
                },
                {
                    "title": "criptografar uma senha usando padrões de criptografia reconhecidos globalmente",
                    "isCorrect": false
                },
                {
                    "title": "impedir que os usuários usem palavras específicas em suas senhas",
                    "isCorrect": true
                }
            ],
            "explanation": "A Proteção de Senha do Azure AD detecta e bloqueia senhas fracas conhecidas e suas variantes, e também pode bloquear termos fracos adicionais que são específicos para sua organização. Com a Proteção de Senha do Azure AD, listas globais de senhas banidas por padrão são aplicadas automaticamente a todos os usuários em um tenant do Azure AD. Para apoiar suas próprias necessidades de negócios e segurança, você pode definir entradas em uma lista personalizada de senhas banidas."
        },        
        {
            "type": "choose",
            "question": "Qual recurso pode ser usado para avaliar a associação a grupos e remover automaticamente usuários que não precisam mais ser membros de um grupo?",
            "statements": [
                {
                    "title": "revisões de acesso",
                    "isCorrect": true
                },
                {
                    "title": "identidades gerenciadas",
                    "isCorrect": false
                },
                {
                    "title": "políticas de acesso condicional",
                    "isCorrect": false
                },
                {
                    "title": "Proteção de Identidade do Azure AD",
                    "isCorrect": false
                }
            ],
            "explanation": "As revisões de acesso do Azure Active Directory (Azure AD) permitem que as organizações gerenciem de forma eficiente as associações a grupos, o acesso a aplicativos empresariais e atribuições de funções. Não há capacidade de remover automaticamente os direitos de acesso do usuário. O ponto principal das revisões de acesso manuais dirigidas pelo usuário é que, em alguns casos, a automação não é possível."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "As políticas de acesso condicional podem usar o estado do dispositivo como um sinal.",
                    "isCorrect": true
                },
                {
                    "title": "As políticas de acesso condicional se aplicam antes que a autenticação do primeiro fator seja concluída.",
                    "isCorrect": false
                },
                {
                    "title": "As políticas de acesso condicional podem acionar a autenticação multifator (MFA) se um usuário tentar acessar um aplicativo específico.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Sim -\nBox 2: Não - As políticas de Acesso Condicional são aplicadas após a conclusão da autenticação do primeiro fator.\nBox 3: Sim -"
        },
        {
            "type": "select",
            "question": "Qual produto Microsoft Defender é uma solução baseada em nuvem que aproveita os sinais do Active Directory local para identificar, detectar e investigar ameaças avançadas?",
            "statements": [
                {
                    "title": "Microsoft Defender para Aplicativos em Nuvem",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Endpoint",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Identidade",
                    "isCorrect": true
                },
                {
                    "title": "Microsoft Defender para Office 365",
                    "isCorrect": false
                }
            ],
            "explanation": "O Microsoft Defender para Identidade é uma solução de segurança baseada em nuvem que aproveita os sinais do Active Directory local para identificar, detectar e investigar ameaças avançadas, identidades comprometidas e ações mal-intencionadas direcionadas à sua organização."
        },
        {
            "type": "select",
            "question": "O Microsoft Defender para Identidade pode identificar ameaças avançadas a partir de",
            "statements": [
                {
                    "title": "Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "Azure AD Connect",
                    "isCorrect": false
                },
                {
                    "title": "Serviços de Domínio do Active Directory (AD DS) local",
                    "isCorrect": true
                }
            ],
            "explanation": "O Microsoft Defender para Identidade é uma solução de segurança baseada em nuvem que aproveita os sinais do Active Directory local para identificar, detectar e investigar ameaças avançadas, identidades comprometidas e ações mal-intencionadas direcionadas à sua organização."
        },
        {
            "type": "select",
            "question": "requer verificação adicional, como um código de verificação enviado para um telefone celular.",
            "statements": [
                {
                    "title": "Autenticação de passagem",
                    "isCorrect": false
                },
                {
                    "title": "Autenticação multifator (MFA)",
                    "isCorrect": true
                },
                {
                    "title": "Escrita de senha",
                    "isCorrect": false
                },
                {
                    "title": "Logon único (SSO)",
                    "isCorrect": false
                }
            ],
            "explanation": "A autenticação multifator é um processo onde o usuário é solicitado durante o processo de login por uma forma adicional de identificação, como inserir um código em seu celular ou fornecer uma digitalização de impressão digital."
        },
        {
            "type": "select",
            "question": "O Azure Active Directory (Azure AD) é ... usado para autenticação e autorização.",
            "statements": [
                {
                    "title": "um sistema de resposta estendida e detecção (XDR)",
                    "isCorrect": false
                },
                {
                    "title": "um provedor de identidade",
                    "isCorrect": true
                },
                {
                    "title": "um grupo de gerenciamento",
                    "isCorrect": false
                },
                {
                    "title": "um sistema de gerenciamento de eventos e informações de segurança (SIEM)",
                    "isCorrect": false
                }
            ],
            "explanation": "O Azure Active Directory (Azure AD) é um serviço de identidade e autenticação de usuário baseado em nuvem."
        },        
        {
            "type": "choose",
            "question": "Qual recurso do Azure Active Directory (Azure AD) você pode usar para fornecer acesso just-in-time (JIT) para gerenciar recursos do Azure?",
            "statements": [
                {
                    "title": "políticas de acesso condicional",
                    "isCorrect": false
                },
                {
                    "title": "Proteção de Identidade do Azure AD",
                    "isCorrect": false
                },
                {
                    "title": "Azure AD Privileged Identity Management (PIM)",
                    "isCorrect": true
                },
                {
                    "title": "políticas de método de autenticação",
                    "isCorrect": false
                }
            ],
            "explanation": "O Azure AD Privileged Identity Management (PIM) fornece acesso privilegiado just-in-time ao Azure AD e aos recursos do Azure."
        },
        {
            "type": "choose",
            "question": "Quais três métodos de autenticação podem ser usados pelo Azure Multi-Factor Authentication (MFA)?",
            "statements": [
                {
                    "title": "mensagem de texto (SMS)",
                    "isCorrect": true
                },
                {
                    "title": "aplicativo Microsoft Authenticator",
                    "isCorrect": true
                },
                {
                    "title": "verificação por email",
                    "isCorrect": false
                },
                {
                    "title": "chamada telefônica",
                    "isCorrect": true
                },
                {
                    "title": "pergunta de segurança",
                    "isCorrect": false
                }
            ],
            "explanation": "O Azure AD Multi-Factor Authentication suporta os seguintes métodos de verificação:\n- Aplicativo Microsoft Authenticator\n- Windows Hello para Empresas\n- Chave de segurança FIDO2\n- Token de hardware OATH (prévia)\n- Token de software OATH\n- SMS\n- Chamada de voz\n\nPara mais informações, consulte:\nhttps://docs.microsoft.com/pt-br/azure/active-directory/authentication/concept-mfa-howitworks\nhttps://docs.microsoft.com/pt-br/azure/active-directory/authentication/concept-authentication-methods"
        },
        {
            "type": "choose",
            "question": "Qual recurso do Microsoft 365 você pode usar para restringir a comunicação e o compartilhamento de informações entre membros de dois departamentos da sua organização?",
            "statements": [
                {
                    "title": "políticas de rótulo de sensibilidade",
                    "isCorrect": false
                },
                {
                    "title": "Customer Lockbox",
                    "isCorrect": false
                },
                {
                    "title": "barreiras de informação",
                    "isCorrect": true
                },
                {
                    "title": "Gerenciamento de Acesso Privilegiado (PAM)",
                    "isCorrect": false
                }
            ],
            "explanation": "As barreiras de informação são um recurso do Microsoft 365 que você pode usar para restringir a comunicação e o compartilhamento de informações entre membros de dois departamentos da sua organização. Referência: https://docs.microsoft.com/pt-br/microsoft-365/compliance/information-barriers"
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "As políticas de acesso condicional sempre aplicam o uso da autenticação multifator (MFA).",
                    "isCorrect": false
                },
                {
                    "title": "As políticas de acesso condicional podem ser usadas para bloquear o acesso a um aplicativo com base na localização do usuário.",
                    "isCorrect": true
                },
                {
                    "title": "As políticas de acesso condicional afetam apenas os usuários que possuem dispositivos associados ao Azure Active Directory (Azure AD).",
                    "isCorrect": false
                }
            ],
            "explanation": "As políticas de acesso condicional são ferramentas poderosas para gerenciar o acesso dos usuários no Azure AD. Elas não aplicam sempre a MFA, mas podem ser configuradas para exigi-la com base em certas condições, como localização. Essas políticas se aplicam a todos os usuários, não apenas àqueles com dispositivos associados ao Azure AD."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "As políticas de acesso condicional podem ser aplicadas a administradores globais.",
                    "isCorrect": true
                },
                {
                    "title": "As políticas de acesso condicional são avaliadas antes de um usuário ser autenticado.",
                    "isCorrect": false
                },
                {
                    "title": "As políticas de acesso condicional podem usar uma plataforma de dispositivo, como Android ou iOS, como um sinal.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Sim - As políticas de acesso condicional podem ser aplicadas a todos os usuários\n\nBox 2: Não - As políticas de acesso condicional são aplicadas após a conclusão da autenticação do primeiro fator.\n\nBox 3: Sim - Usuários com dispositivos de plataformas específicas ou marcados com um estado específico podem ser usados ao aplicar políticas de Acesso Condicional."
        },
        {
            "type": "select",
            "question": "Aplicativos registrados no Azure Active Directory (Azure AD) são associados automaticamente a um ...",
            "statements": [
                {
                    "title": "conta de convidado.",
                    "isCorrect": false
                },
                {
                    "title": "principal de serviço.",
                    "isCorrect": true
                },
                {
                    "title": "identidade gerenciada.",
                    "isCorrect": false
                },
                {
                    "title": "conta de usuário.",
                    "isCorrect": false
                }
            ],
            "explanation": "Quando você registra um aplicativo através do portal do Azure, um objeto de aplicativo e um principal de serviço são criados automaticamente em seu diretório ou tenant. Um principal de serviço é uma identidade de segurança usada para representar um aplicativo no Azure Active Directory (AAD). Ele é usado para autenticar o aplicativo para acessar recursos e também para atribuir permissões a esses recursos. Um principal de serviço é como uma identidade de usuário (login e senha ou certificado) para um aplicativo. Um objeto de aplicativo, por outro lado, é uma representação de um aplicativo no Azure Active Directory. Ele contém informações sobre o aplicativo, como seu nome e URL, bem como seu principal de serviço associado. Em resumo, um principal de serviço é uma identidade de segurança usada para autenticar um aplicativo, enquanto um objeto de aplicativo é uma representação do aplicativo no Azure Active Directory que contém informações sobre o aplicativo e seu principal de serviço associado. Quando você registra um aplicativo através do portal do Azure, um objeto de aplicativo e um principal de serviço são criados automaticamente em seu diretório ou tenant."
        },
        {
            "type": "choose",
            "question": "Quais três métodos de autenticação o Windows Hello para Empresas suporta? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "impressão digital",
                    "isCorrect": true
                },
                {
                    "title": "reconhecimento facial",
                    "isCorrect": true
                },
                {
                    "title": "PIN",
                    "isCorrect": true
                },
                {
                    "title": "verificação por email",
                    "isCorrect": false
                },
                {
                    "title": "pergunta de segurança",
                    "isCorrect": false
                }
            ],
            "explanation": "O Windows Hello no Windows 10 permite que os usuários façam login usando um PIN, impressão digital ou reconhecimento facial. Referência: https://docs.microsoft.com/pt-br/windows/security/identity-protection/hello-for-business/hello-why-pin-is-better-than-password"
        },
        {
            "type": "choose",
            "question": "Quando você habilita os padrões de segurança no Azure Active Directory (Azure AD), ... será habilitado para todos os usuários do Azure AD.",
            "statements": [
                {
                    "title": "Proteção de Identidade do Azure AD",
                    "isCorrect": false
                },
                {
                    "title": "autenticação multifator (MFA)",
                    "isCorrect": true
                },
                {
                    "title": "Azure AD Privileged Identity Management (PIM)",
                    "isCorrect": false
                }
            ],
            "explanation": "Os padrões de segurança facilitam a proteção da sua organização contra esses ataques com configurações de segurança pré-configuradas:\n\n- Exigir que todos os usuários se registrem para a autenticação multifator do Azure AD.\n\n- Exigir que os administradores façam autenticação multifator.\n\n- Bloquear protocolos de autenticação legada.\n\n- Exigir que os usuários façam autenticação multifator quando necessário.\n\n- Proteger atividades privilegiadas, como acesso ao portal do Azure."
        },        
        {
            "type": "choose",
            "question": "Para implementar a ativação de função com base em aprovação e tempo em uma assinatura do Azure, você deve usar ...",
            "statements": [
                {
                    "title": "Windows Hello para Empresas",
                    "isCorrect": false
                },
                {
                    "title": "Proteção de Identidade do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "revisões de acesso no Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "Gerenciamento de Identidade com Privilégios (PIM) do Azure Active Directory (Azure AD)",
                    "isCorrect": true
                }
            ],
            "explanation": "O Gerenciamento de Identidade com Privilégios (PIM) do Azure Active Directory (Azure AD) é projetado especificamente para implementar a ativação de função com base em aprovação e tempo em uma assinatura do Azure. O PIM permite gerenciar e controlar o acesso a funções privilegiadas no Azure AD, recursos do Azure e aplicativos SaaS integrados ao Azure AD. Ele permite elevar o acesso de forma just-in-time e fornece um fluxo de trabalho de aprovação para ativação de função, que pode ser restrito a períodos específicos. Isso faz dele a escolha ideal para implementar os requisitos especificados na pergunta."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Os administradores globais estão isentos das políticas de acesso condicional",
                    "isCorrect": false
                },
                {
                    "title": "Uma política de acesso condicional pode adicionar usuários às funções do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "As políticas de acesso condicional podem forçar o uso da autenticação multifator (MFA) para acessar aplicativos em nuvem",
                    "isCorrect": true
                }
            ],
            "explanation": "As políticas de acesso condicional são ferramentas poderosas para gerenciar o acesso dos usuários no Azure AD. Elas não isentam administradores globais por padrão e não podem adicionar usuários a funções. No entanto, podem impor MFA para acessar aplicativos em nuvem."
        },
        {
            "type": "choose",
            "question": "Quando os padrões de segurança estão habilitados para um tenant do Azure Active Directory (Azure AD), quais dois requisitos são aplicados? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "Todos os usuários devem autenticar-se a partir de um dispositivo registrado.",
                    "isCorrect": false
                },
                {
                    "title": "Os administradores devem sempre usar a Autenticação Multifator (MFA) do Azure.",
                    "isCorrect": true
                },
                {
                    "title": "O registro de Autenticação Multifator (MFA) do Azure é obrigatório para todos os usuários.",
                    "isCorrect": true
                },
                {
                    "title": "Todos os usuários devem autenticar-se usando login sem senha.",
                    "isCorrect": false
                },
                {
                    "title": "Todos os usuários devem autenticar-se usando o Windows Hello.",
                    "isCorrect": false
                }
            ],
            "explanation": "Os padrões de segurança facilitam a proteção da sua organização com as seguintes configurações de segurança pré-configuradas: Exigir que todos os usuários se registrem para a Autenticação Multifator do Azure AD. Exigir que os administradores façam autenticação multifator. Bloquear protocolos de autenticação legados. Exigir que os usuários façam autenticação multifator quando necessário. Proteger atividades privilegiadas, como acesso ao portal do Azure."
        },
        {
            "type": "choose",
            "question": "Que tipo de identidade é criada quando você registra um aplicativo no Active Directory (Azure AD)?",
            "statements": [
                {
                    "title": "uma conta de usuário",
                    "isCorrect": false
                },
                {
                    "title": "uma identidade gerenciada atribuída ao usuário",
                    "isCorrect": false
                },
                {
                    "title": "uma identidade gerenciada atribuída pelo sistema",
                    "isCorrect": false
                },
                {
                    "title": "um principal de serviço",
                    "isCorrect": true
                }
            ],
            "explanation": "Quando você registra um aplicativo através do portal do Azure, um objeto de aplicativo e um principal de serviço são criados automaticamente em seu diretório ou tenant."
        },
        {
            "type": "choose",
            "question": "Quais três tarefas podem ser realizadas usando a Proteção de Identidade do Azure Active Directory (Azure AD)? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "Configurar acesso externo para organizações parceiras.",
                    "isCorrect": false
                },
                {
                    "title": "Exportar a detecção de riscos para utilitários de terceiros.",
                    "isCorrect": true
                },
                {
                    "title": "Automatizar a detecção e remediação de riscos baseados em identidade.",
                    "isCorrect": true
                },
                {
                    "title": "Investigar riscos relacionados à autenticação de usuários.",
                    "isCorrect": true
                },
                {
                    "title": "Criar e atribuir automaticamente rótulos de sensibilidade aos dados.",
                    "isCorrect": false
                }
            ],
            "explanation": "Essas respostas são diretamente dos slides de treinamento SC-900 Fundamentals, que descrevem as principais tarefas que a Proteção de Identidade do Azure permite que as organizações realizem:\n\n- Automatizar a detecção e remediação de riscos baseados em identidade.\n- Investigar riscos usando dados no portal.\n- Exportar dados de detecção de riscos para utilitários de terceiros para análise adicional."
        },        
        {
            "type": "select",
            "question": "Ao usar a autenticação multifator (MFA), uma senha é considerada algo que você ...",
            "statements": [
                {
                    "title": "é",
                    "isCorrect": false
                },
                {
                    "title": "tem",
                    "isCorrect": false
                },
                {
                    "title": "sabe",
                    "isCorrect": true
                },
                {
                    "title": "compartilha",
                    "isCorrect": false
                }
            ],
            "explanation": "Box 1: sabe - A autenticação multifator combina duas ou mais credenciais independentes: o que o usuário sabe, como uma senha; o que o usuário tem, como um token de segurança; e o que o usuário é, usando métodos de verificação biométrica."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Windows Hello para Empresas pode usar o aplicativo Microsoft Authenticator como um método de autenticação.",
                    "isCorrect": false
                },
                {
                    "title": "O Windows Hello para Empresas pode usar um código PIN como um método de autenticação.",
                    "isCorrect": true
                },
                {
                    "title": "As informações de autenticação do Windows Hello para Empresas sincronizam em todos os dispositivos registrados por um usuário.",
                    "isCorrect": false
                }
            ],
            "explanation": "Box 1: Não - O aplicativo Microsoft Authenticator ajuda você a entrar em suas contas quando estiver usando a verificação em duas etapas. A verificação em duas etapas ajuda você a usar suas contas de forma mais segura porque senhas podem ser esquecidas, roubadas ou comprometidas. A verificação em duas etapas usa um segundo fator, como seu telefone, para dificultar que outras pessoas acessem sua conta.\n\nBox 2: Sim - No Windows 10, o Windows Hello para Empresas substitui as senhas por autenticação forte de dois fatores em dispositivos. Esta autenticação consiste em um novo tipo de credencial de usuário que está vinculada a um dispositivo e usa um biométrico ou PIN.\n\nBox 3: Não - As credenciais do Windows Hello são baseadas em certificado ou par de chaves assimétricas. As credenciais do Windows Hello podem ser vinculadas ao dispositivo, e o token obtido usando a credencial também é vinculado ao dispositivo."
        },
        {
            "type": "select",
            "question": "Um recurso do Azure pode usar uma ... atribuída ao sistema para acessar serviços do Azure.",
            "statements": [
                {
                    "title": "dispositivo associado ao Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "identidade gerenciada",
                    "isCorrect": true
                },
                {
                    "title": "principal de serviço",
                    "isCorrect": false
                },
                {
                    "title": "identidade de usuário",
                    "isCorrect": false
                }
            ],
            "explanation": "As identidades gerenciadas fornecem uma identidade para aplicativos usarem ao se conectar a recursos que suportam autenticação do Azure Active Directory (Azure AD). Aqui estão alguns dos benefícios de usar identidades gerenciadas: Você não precisa gerenciar credenciais. As credenciais não são acessíveis para você. Você pode usar identidades gerenciadas para autenticar qualquer recurso que suporte autenticação do Azure AD, incluindo seus próprios aplicativos."
        },
        {
            "type": "select",
            "question": "Você pode usar ... no portal do Microsoft 365 Defender para identificar dispositivos que foram afetados por um alerta.",
            "statements": [
                {
                    "title": "classificações",
                    "isCorrect": false
                },
                {
                    "title": "incidentes",
                    "isCorrect": true
                },
                {
                    "title": "políticas",
                    "isCorrect": false
                },
                {
                    "title": "pontuação de segurança",
                    "isCorrect": false
                }
            ],
            "explanation": "No portal do Microsoft 365 Defender, os incidentes são coleções de alertas relacionados. Usar incidentes ajuda a correlacionar e agrupar alertas, facilitando a identificação e o gerenciamento dos dispositivos afetados por um alerta."
        },
        {
            "type": "choose",
            "question": "Quais são duas capacidades do Microsoft Defender para Endpoint? Cada seleção correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "investigação e remediação automatizadas",
                    "isCorrect": true
                },
                {
                    "title": "criptografia de transporte",
                    "isCorrect": false
                },
                {
                    "title": "detecção de shadow IT",
                    "isCorrect": false
                },
                {
                    "title": "redução da superfície de ataque",
                    "isCorrect": true
                }
            ],
            "explanation": "O Microsoft Defender para Endpoint oferece capacidades de investigação e remediação automatizadas que ajudam a reduzir o volume de alertas em minutos em larga escala. O conjunto de capacidades de redução da superfície de ataque fornece a primeira linha de defesa na pilha.\n\nReferência: https://docs.microsoft.com/pt-br/microsoft-365/security/defender-endpoint/microsoft-defender-endpoint?view=o365-worldwide#microsoft-defender-for-endpoint"
        },        
        {
            "type": "multiple-select",
            "question": [
                "Fornece serviços de Network Address Translation (NAT)",
                "Fornece conectividade Remote Desktop segura e perfeita para máquinas virtuais do Azure",
                "Fornece filtragem de tráfego que pode ser aplicada a interfaces de rede específicas em uma rede virtual"
            ],            
            "explanation": "Box 1: Azure Firewall - O Azure Firewall fornece Source Network Address Translation e Destination Network Address Translation. Box 2: Azure Bastion - O Azure Bastion fornece conectividade segura e perfeita RDP/SSH para suas máquinas virtuais diretamente do portal do Azure via TLS. Box 3: Network security group (NSG) - Você pode usar um grupo de segurança de rede do Azure para filtrar o tráfego de rede de e para recursos do Azure em uma rede virtual do Azure.",
            "statements": [
                {
                    "title": "Azure Bastion",
                    "isCorrect": false
                },
                {
                    "title": "Azure Firewall",
                    "isCorrect": true
                },
                {
                    "title": "Grupo de segurança de rede (NSG)",
                    "isCorrect": true
                }
            ],
            "answers": [
                "Azure Firewall",
                "Azure Bastion",
                "Grupo de segurança de rede (NSG)"
            ]
        },
        {
            "type": "select",
            "question": "... é uma solução de gerenciamento de eventos e informações de segurança (SIEM) e resposta automatizada de orquestração de segurança (SOAR) nativa da nuvem usada para fornecer uma única solução para detecção de alertas, visibilidade de ameaças, caça proativa e resposta a ameaças.",
            "statements": [
                {
                    "title": "Azure Advisor",
                    "isCorrect": false
                },
                {
                    "title": "Azure Bastion",
                    "isCorrect": false
                },
                {
                    "title": "Azure Monitor",
                    "isCorrect": false
                },
                {
                    "title": "Azure Sentinel",
                    "isCorrect": true
                }
            ],
            "explanation": "O Microsoft Azure Sentinel é uma solução escalável, nativa da nuvem, de gerenciamento de eventos e informações de segurança (SIEM) e resposta automatizada de orquestração de segurança (SOAR)."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Azure Defender pode detectar vulnerabilidades e ameaças para o Azure Storage.",
                    "isCorrect": true
                },
                {
                    "title": "A gestão de postura de segurança em nuvem (CSPM) está disponível para todas as assinaturas do Azure.",
                    "isCorrect": true
                },
                {
                    "title": "O Azure Security Center pode avaliar a segurança das cargas de trabalho implantadas no Azure ou localmente.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Sim - O Microsoft Defender para Nuvem fornece alertas de segurança e proteção avançada contra ameaças para máquinas virtuais, bancos de dados SQL, contêineres, aplicativos web, sua rede, seu armazenamento e muito mais.\n\nBox 2: Sim - A gestão de postura de segurança em nuvem (CSPM) está disponível gratuitamente para todos os usuários do Azure.\n\nBox 3: Sim - O Azure Security Center é um sistema unificado de gerenciamento de segurança de infraestrutura que fortalece a postura de segurança dos seus data centers e fornece proteção avançada contra ameaças em suas cargas de trabalho híbridas na nuvem - estejam elas no Azure ou não - assim como localmente."
        },
        {
            "type": "select",
            "question": "Você pode usar ... no centro de segurança do Microsoft 365 para ver uma agregação de alertas relacionados ao mesmo ataque.",
            "statements": [
                {
                    "title": "Relatórios",
                    "isCorrect": false
                },
                {
                    "title": "Caça",
                    "isCorrect": false
                },
                {
                    "title": "Simulador de ataque",
                    "isCorrect": false
                },
                {
                    "title": "Incidentes",
                    "isCorrect": true
                }
            ],
            "explanation": "Uma visão dos incidentes relacionados a ameaças que agregam alertas em histórias de ataques de ponta a ponta em todo o Microsoft Defender para Endpoint e Microsoft Defender para Office 365 para reduzir a fila de trabalho, além de simplificar e acelerar sua investigação."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Os grupos de segurança de rede (NSGs) podem negar tráfego de entrada da internet.",
                    "isCorrect": true
                },
                {
                    "title": "Os grupos de segurança de rede (NSGs) podem negar tráfego de saída para a internet.",
                    "isCorrect": true
                },
                {
                    "title": "Os grupos de segurança de rede (NSGs) podem filtrar tráfego com base no endereço IP, protocolo e porta.",
                    "isCorrect": true
                }
            ],
            "explanation": "Você pode usar um grupo de segurança de rede do Azure para filtrar o tráfego de rede de e para recursos do Azure em uma rede virtual do Azure. Um grupo de segurança de rede contém regras de segurança que permitem ou negam o tráfego de rede de entrada para, ou o tráfego de rede de saída de, vários tipos de recursos do Azure. Para cada regra, você pode especificar origem e destino, porta e protocolo."
        },        
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Microsoft Intune pode ser usado para gerenciar dispositivos Android.",
                    "isCorrect": true
                },
                {
                    "title": "O Microsoft Intune pode ser usado para provisionar assinaturas do Azure.",
                    "isCorrect": false
                },
                {
                    "title": "O Microsoft Intune pode ser usado para gerenciar dispositivos corporativos e dispositivos pessoais.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Sim - O Microsoft Intune é um serviço baseado em nuvem que se concentra no gerenciamento de dispositivos móveis (MDM) e no gerenciamento de aplicativos móveis (MAM). Você pode controlar como os dispositivos da sua organização são usados, incluindo celulares, tablets e laptops.\n\nBox 2: Não - O Microsoft Intune não é usado para provisionar assinaturas do Azure. O provisionamento de assinaturas do Azure é um serviço separado.\n\nBox 3: Sim - Com o Intune, você pode gerenciar dispositivos corporativos e dispositivos pessoais dos usuários, garantindo que eles estejam em conformidade com suas políticas de segurança e conformidade."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Você pode criar um Azure Bastion por rede virtual.",
                    "isCorrect": true
                },
                {
                    "title": "O Azure Bastion fornece conexões seguras para usuários usando RDP.",
                    "isCorrect": true
                },
                {
                    "title": "O Azure Bastion fornece uma conexão segura a uma máquina virtual do Azure usando o portal do Azure.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Sim - O Azure Bastion é implantado por rede virtual e permite conectividade RDP e SSH perfeita para suas máquinas virtuais diretamente do portal do Azure via SSL.\n\nBox 2: Sim - O Azure Bastion fornece conectividade segura RDP e SSH, usando a experiência baseada em navegador no portal do Azure.\n\nBox 3: Sim - O Azure Bastion fornece uma conexão segura para suas máquinas virtuais através do portal do Azure sem expô-las à internet pública."
        },
        {
            "type": "choose",
            "question": "Qual recurso do Microsoft Defender para Endpoint fornece a primeira linha de defesa contra ameaças cibernéticas, reduzindo a superfície de ataque?",
            "statements": [
                {
                    "title": "remediação automatizada",
                    "isCorrect": false
                },
                {
                    "title": "investigação automatizada",
                    "isCorrect": false
                },
                {
                    "title": "caça avançada",
                    "isCorrect": false
                },
                {
                    "title": "proteção de rede",
                    "isCorrect": true
                }
            ],
            "explanation": "A proteção de rede ajuda a proteger dispositivos contra eventos baseados na Internet. A proteção de rede é uma capacidade de redução da superfície de ataque."
        },
        {
            "type": "select",
            "question": "No Microsoft Sentinel, você pode automatizar tarefas comuns usando ...",
            "statements": [
                {
                    "title": "ferramentas de investigação profunda.",
                    "isCorrect": false
                },
                {
                    "title": "playbooks.",
                    "isCorrect": true
                },
                {
                    "title": "ferramentas de busca e consulta de caça.",
                    "isCorrect": false
                },
                {
                    "title": "workbooks.",
                    "isCorrect": false
                }
            ],
            "explanation": "Os workbooks no Azure Sentinel são painéis interativos que permitem aos usuários explorar e analisar dados de segurança. Eles fornecem uma representação visual dos dados de segurança, permitindo que os usuários identifiquem rapidamente padrões e tendências. Os workbooks podem ser personalizados para exibir dados específicos e podem ser compartilhados com outros usuários.\n\nOs playbooks no Azure Sentinel são capacidades de resposta automatizada que permitem aos usuários tomar ações em incidentes de segurança. Eles fornecem um conjunto de playbooks e ações predefinidos para ajudar os usuários a responder a incidentes de segurança de forma rápida e eficaz. Os playbooks podem ser acionados por eventos ou condições específicas e podem ser personalizados para atender às necessidades da organização. Eles também têm a capacidade de integrar com outros serviços do Azure e ferramentas de terceiros, e podem ser usados para automatizar tarefas de triagem de incidentes, investigações e remediação.\n\nEm resumo, os workbooks são para análise e visualização de dados de segurança, enquanto os playbooks são para resposta automatizada a incidentes."
        },
        {
            "type": "choose",
            "question": "Quais dois tipos de recursos podem ser protegidos usando o Azure Firewall? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "Máquinas virtuais do Azure",
                    "isCorrect": true
                },
                {
                    "title": "Usuários do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "Caixas de entrada do Microsoft Exchange Online",
                    "isCorrect": false
                },
                {
                    "title": "Redes virtuais do Azure",
                    "isCorrect": true
                },
                {
                    "title": "Sites do Microsoft SharePoint Online",
                    "isCorrect": false
                }
            ],
            "explanation": "O Azure Firewall pode proteger máquinas virtuais do Azure e redes virtuais do Azure aplicando políticas de segurança de rede em assinaturas e redes virtuais."
        },
        {
            "type": "choose",
            "question": "Você planeja implementar uma estratégia de segurança e colocar várias camadas de defesa em toda a infraestrutura de rede. Qual metodologia de segurança isso representa?",
            "statements": [
                {
                    "title": "modelagem de ameaças",
                    "isCorrect": false
                },
                {
                    "title": "identidade como o perímetro de segurança",
                    "isCorrect": false
                },
                {
                    "title": "defesa em profundidade",
                    "isCorrect": true
                },
                {
                    "title": "o modelo de responsabilidade compartilhada",
                    "isCorrect": false
                }
            ],
            "explanation": "A defesa em profundidade abrange várias camadas, como Dados, Aplicação, Computação, Rede, Perímetro, Identidade e Acesso e Físico. Destas, a camada física é principalmente responsabilidade do provedor de nuvem."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Microsoft Defender para Endpoint pode proteger dispositivos Android.",
                    "isCorrect": true
                },
                {
                    "title": "O Microsoft Defender para Endpoint pode proteger máquinas virtuais do Azure que executam o Windows 10.",
                    "isCorrect": true
                },
                {
                    "title": "O Microsoft Defender para Endpoint pode proteger sites e conteúdos do Microsoft SharePoint Online contra vírus.",
                    "isCorrect": false
                }
            ],
            "explanation": "Box 1: Sim - O Microsoft Defender para Endpoint é capaz de estender as capacidades de proteção de endpoint para dispositivos Android, fornecendo defesa abrangente contra várias ameaças. Box 2: Sim - Ele também pode proteger máquinas virtuais do Azure executando o Windows 10, oferecendo proteção avançada contra ameaças e opções de remediação. Box 3: Não - Embora o Microsoft Defender para Endpoint ofereça proteção extensiva de endpoints, ele não protege especificamente sites e conteúdos do SharePoint Online contra vírus; essa responsabilidade é geralmente gerenciada por outras soluções de segurança dentro do pacote Microsoft 365."
        },
        {
            "type": "choose",
            "question": "O que você pode usar para escanear anexos de email e encaminhar os anexos para os destinatários apenas se os anexos estiverem livres de malware?",
            "statements": [
                {
                    "title": "Microsoft Defender para Office 365",
                    "isCorrect": true
                },
                {
                    "title": "Microsoft Defender Antivirus",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Identidade",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Endpoint",
                    "isCorrect": false
                }
            ],
            "explanation": "O Microsoft Defender para Office 365 fornece proteção avançada contra ameaças para email e ferramentas de colaboração. Ele ajuda a proteger contra ameaças maliciosas representadas por mensagens de email, links (URLs) e ferramentas de colaboração, incluindo a verificação de anexos para malware."
        },
        {
            "type": "choose",
            "question": "Qual recurso fornece a capacidade de detecção e resposta estendida (XDR) do Azure Sentinel?",
            "statements": [
                {
                    "title": "integração com o centro de conformidade do Microsoft 365",
                    "isCorrect": false
                },
                {
                    "title": "suporte à caça de ameaças",
                    "isCorrect": false
                },
                {
                    "title": "integração com o Microsoft 365 Defender",
                    "isCorrect": true
                },
                {
                    "title": "suporte a Workbooks do Azure Monitor",
                    "isCorrect": false
                }
            ],
            "explanation": "O conector Microsoft 365 Defender para Azure Sentinel envia todas as informações de incidentes e alertas do Microsoft 365 Defender para o Azure Sentinel e mantém os incidentes sincronizados. Ele permite contexto na triagem e resposta a incidentes, transmitindo incidentes, alertas e informações relevantes de vários serviços do Microsoft Defender para o Azure Sentinel. Esta integração mantém os incidentes sincronizados bidirecionalmente com o Microsoft 365 Defender, permitindo benefícios de ambos os portais para investigação e resposta a incidentes."
        },
        {
            "type": "choose",
            "question": "O que pode ser usado para fornecer detecção de ameaças para o Azure SQL Managed Instance?",
            "statements": [
                {
                    "title": "Microsoft Secure Score",
                    "isCorrect": false
                },
                {
                    "title": "grupos de segurança de aplicativos",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Nuvem",
                    "isCorrect": true
                },
                {
                    "title": "Azure Bastion",
                    "isCorrect": false
                }
            ],
            "explanation": "O Microsoft Defender para SQL é um plano de Defender no Microsoft Defender para Nuvem. O Microsoft Defender para SQL inclui funcionalidades para revelar e mitigar possíveis vulnerabilidades de banco de dados e detectar atividades anômalas que podem indicar uma ameaça ao seu banco de dados. Ele fornece um único local para habilitar e gerenciar essas capacidades."
        },        
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "A Pontuação de Segurança da Microsoft no centro de segurança do Microsoft 365 pode fornecer recomendações para o Microsoft Cloud App Security.",
                    "isCorrect": false
                },
                {
                    "title": "No portal do Microsoft 365 Defender, você pode ver como sua Pontuação de Segurança da Microsoft se compara à pontuação de organizações como a sua.",
                    "isCorrect": true
                },
                {
                    "title": "A Pontuação de Segurança da Microsoft no portal do Microsoft 365 Defender lhe dá pontos se você resolver a ação de melhoria usando um aplicativo ou software de terceiros.",
                    "isCorrect": true
                }
            ],
            "explanation": "As organizações ganham acesso a visualizações robustas de métricas e tendências, integração com outros produtos da Microsoft, comparação de pontuação com organizações semelhantes e muito mais. A pontuação também pode refletir quando soluções de terceiros abordaram ações recomendadas."
        },
        {
            "type": "choose",
            "question": "Qual recurso do Azure Active Directory (Azure AD) você pode usar para restringir dispositivos gerenciados pelo Microsoft Intune de acessar recursos corporativos?",
            "statements": [
                {
                    "title": "grupos de segurança de rede (NSGs)",
                    "isCorrect": false
                },
                {
                    "title": "Gerenciamento de Identidade com Privilégios (PIM) do Azure AD",
                    "isCorrect": false
                },
                {
                    "title": "políticas de acesso condicional",
                    "isCorrect": true
                },
                {
                    "title": "bloqueios de recursos",
                    "isCorrect": false
                }
            ],
            "explanation": "Quando você usa Acesso Condicional, pode configurar suas políticas de Acesso Condicional para usar os resultados de suas políticas de conformidade de dispositivos para determinar quais dispositivos podem acessar seus recursos organizacionais. Esse controle de acesso é adicional e separado das ações para não conformidade que você inclui em suas políticas de conformidade de dispositivos."
        },
        {
            "type": "select",
            "question": "... pode usar políticas de acesso condicional para controlar sessões em tempo real.",
            "statements": [
                {
                    "title": "Gerenciamento de Identidade com Privilégios (PIM) do Azure AD",
                    "isCorrect": false
                },
                {
                    "title": "Azure Defender",
                    "isCorrect": false
                },
                {
                    "title": "Azure Sentinel",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Cloud App Security",
                    "isCorrect": true
                }
            ],
            "explanation": "O Microsoft Cloud App Security foi renomeado para Microsoft Defender for Cloud Apps: https://techcommunity.microsoft.com/t5/itops-talk-blog/azure-security-product-name-changes-microsoft-ignite-november/ba-p/3004418?WT.mc_id=modinfra-48365-socuff"
        },
        {
            "type": "select",
            "question": "A Proteção DDoS Padrão do Azure pode ser usada para proteger...",
            "statements": [
                {
                    "title": "aplicativos do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "usuários do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "grupos de recursos",
                    "isCorrect": false
                },
                {
                    "title": "redes virtuais",
                    "isCorrect": true
                }
            ],
            "explanation": "A Proteção DDoS Padrão do Azure fornece recursos aprimorados de mitigação de DDoS para defender contra ataques de DDoS. Ela é particularmente eficaz em proteger redes virtuais ao fornecer monitoramento de tráfego sempre ativo e mitigação em tempo real de ataques DDoS."
        },
        {
            "type": "choose",
            "question": "O que você deve usar no portal do Microsoft 365 Defender para ver tendências de segurança e acompanhar o status de proteção de identidades?",
            "statements": [
                {
                    "title": "Simulador de ataque",
                    "isCorrect": false
                },
                {
                    "title": "Relatórios",
                    "isCorrect": true
                },
                {
                    "title": "Caça",
                    "isCorrect": false
                },
                {
                    "title": "Incidentes",
                    "isCorrect": false
                }
            ],
            "explanation": "Palavra-chave é tendências = relatórios"
        },
        {
            "type": "choose",
            "question": "Você tem uma assinatura do Microsoft 365 E3. Você planeja auditar a atividade do usuário usando o log de auditoria unificado e a Auditoria Básica. Por quanto tempo os registros de auditoria serão mantidos?",
            "statements": [
                {
                    "title": "15 dias",
                    "isCorrect": false
                },
                {
                    "title": "30 dias",
                    "isCorrect": false
                },
                {
                    "title": "90 dias",
                    "isCorrect": true
                },
                {
                    "title": "180 dias",
                    "isCorrect": false
                }
            ],
            "explanation": "A auditoria unificada do Microsoft 365 ajuda a rastrear atividades realizadas nos diferentes serviços do Microsoft 365 por usuários e administradores. A auditoria básica é habilitada por padrão para a maioria das organizações do Microsoft 365. Na auditoria básica, os registros de auditoria são mantidos e pesquisáveis pelos últimos 90 dias."
        },
        {
            "type": "choose",
            "question": "Para qual tipo de recurso o Azure Bastion pode fornecer acesso seguro?",
            "statements": [
                {
                    "title": "Arquivos do Azure",
                    "isCorrect": false
                },
                {
                    "title": "Instâncias Gerenciadas do Azure SQL",
                    "isCorrect": false
                },
                {
                    "title": "Máquinas virtuais do Azure",
                    "isCorrect": true
                },
                {
                    "title": "Azure App Service",
                    "isCorrect": false
                }
            ],
            "explanation": "O Azure Bastion fornece conectividade RDP/SSH segura e perfeita para máquinas virtuais diretamente do portal do Azure via TLS. Para mais informações, consulte a documentação da Microsoft sobre o Azure Bastion: https://docs.microsoft.com/pt-br/azure/bastion/bastion-overview"
        },
        {
            "type": "choose",
            "question": "Quais são três usos do Microsoft Cloud App Security? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "descobrir e controlar o uso de shadow IT",
                    "isCorrect": true
                },
                {
                    "title": "fornecer conexões seguras para máquinas virtuais do Azure",
                    "isCorrect": false
                },
                {
                    "title": "proteger informações sensíveis hospedadas em qualquer lugar na nuvem",
                    "isCorrect": true
                },
                {
                    "title": "fornecer autenticação de passagem para aplicativos locais",
                    "isCorrect": false
                },
                {
                    "title": "prevenir vazamentos de dados para aplicativos não conformes e limitar o acesso a dados regulamentados",
                    "isCorrect": true
                }
            ],
            "explanation": "As respostas corretas podem ser encontradas em https://docs.microsoft.com/pt-br/defender-cloud-apps/what-is-defender-for-cloud-apps. Procure o título 'The Defender for Cloud Apps framework' no artigo."
        },
        {
            "type": "select",
            "question": "No portal do Microsoft 365 Defender, um incidente é uma coleção de ... correlacionados.",
            "statements": [
                {
                    "title": "alertas",
                    "isCorrect": true
                },
                {
                    "title": "eventos",
                    "isCorrect": false
                },
                {
                    "title": "vulnerabilidades",
                    "isCorrect": false
                },
                {
                    "title": "ações de melhoria da Pontuação de Segurança da Microsoft",
                    "isCorrect": false
                }
            ],
            "explanation": "Um incidente no Microsoft 365 Defender é uma coleção de alertas correlacionados e dados associados que compõem a história de um ataque. https://learn.microsoft.com/es-es/microsoft-365/security/defender/incidents-overview?view=o365-worldwide"
        },        
        {
            "type": "choose",
            "question": "Você precisa se conectar a uma máquina virtual do Azure usando o Azure Bastion. O que você deve usar?",
            "statements": [
                {
                    "title": "PowerShell remoting",
                    "isCorrect": false
                },
                {
                    "title": "o portal do Azure",
                    "isCorrect": true
                },
                {
                    "title": "o cliente de Conexão de Área de Trabalho Remota",
                    "isCorrect": false
                },
                {
                    "title": "um cliente SSH",
                    "isCorrect": false
                }
            ],
            "explanation": "Portal do Azure, B. toda a ideia do bastion é manter a porta RDP 3389 fechada. O Portal do Azure é a única opção fornecida que não requer o cliente nativo SSH ou RDP já instalado no seu computador local. Então, eu devo usar o Portal do Azure."
        },
        {
            "type": "choose",
            "question": "Qual serviço inclui o recurso de treinamento de simulação de ataque?",
            "statements": [
                {
                    "title": "Microsoft Defender para Aplicativos em Nuvem",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Identidade",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para SQL",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Office 365",
                    "isCorrect": true
                }
            ],
            "explanation": "O treinamento de simulação de ataque no Microsoft Defender para Office 365 Plano 2 ou Microsoft 365 E5 permite que você execute simulações de ciberataques benignos em sua organização. Essas simulações testam suas políticas e práticas de segurança, além de treinar seus funcionários para aumentar a conscientização e diminuir a susceptibilidade a ataques."
        },
        {
            "type": "choose",
            "question": "Qual tipo de alerta você pode gerenciar a partir do portal do Microsoft 365 Defender?",
            "statements": [
                {
                    "title": "Microsoft Defender para Armazenamento",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para SQL",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Endpoint",
                    "isCorrect": true
                },
                {
                    "title": "Microsoft Defender para IoT",
                    "isCorrect": false
                }
            ],
            "explanation": "A fila de alertas mostra o conjunto atual de alertas. Você acessa a fila de alertas a partir de Incidentes e alertas > Alertas no acesso rápido do portal do Microsoft 365 Defender. Alertas de diferentes soluções de segurança da Microsoft, como Microsoft Defender para Endpoint, Microsoft Defender para Office 365 e Microsoft 365 Defender aparecem aqui."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Os conectores de dados do Microsoft Sentinel suportam apenas serviços da Microsoft.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode usar workbooks do Azure Monitor para monitorar os dados coletados pelo Microsoft Sentinel.",
                    "isCorrect": true
                },
                {
                    "title": "Caça fornece a capacidade de identificar ameaças de segurança antes que um alerta seja acionado.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Não - Os conectores de dados do Microsoft Sentinel estão disponíveis para serviços não-Microsoft, como Amazon Web Services.\n\nBox 2: Sim - Uma vez conectadas suas fontes de dados ao Microsoft Sentinel, você pode visualizar e monitorar os dados usando a adoção do Microsoft Sentinel de Workbooks do Azure Monitor, que fornece versatilidade na criação de painéis personalizados. Embora os Workbooks sejam exibidos de forma diferente no Microsoft Sentinel, pode ser útil para você ver como criar relatórios interativos com Workbooks do Azure Monitor. O Microsoft Sentinel permite que você crie workbooks personalizados em seus dados, e também vem com templates de workbooks integrados para permitir que você ganhe rapidamente insights em seus dados assim que conectar uma fonte de dados.\n\nBox 3: Sim - Para ajudar analistas de segurança a procurar proativamente por novas anomalias que não foram detectadas por seus aplicativos de segurança ou até mesmo por suas regras analíticas agendadas, as consultas de caça integradas do Microsoft Sentinel guiam você a fazer as perguntas certas para encontrar problemas nos dados que você já possui em sua rede."
        },
        {
            "type": "choose",
            "question": "Com quais dois recursos do Azure um grupo de segurança de rede (NSG) pode ser associado? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "um sub-rede de rede virtual",
                    "isCorrect": true
                },
                {
                    "title": "uma interface de rede",
                    "isCorrect": true
                },
                {
                    "title": "um grupo de recursos",
                    "isCorrect": false
                },
                {
                    "title": "uma rede virtual",
                    "isCorrect": false
                },
                {
                    "title": "um aplicativo web do Azure App Service",
                    "isCorrect": false
                }
            ],
            "explanation": "Associação de grupos de segurança de rede: Você pode associar um grupo de segurança de rede a máquinas virtuais, NICs e sub-redes, dependendo do modelo de implantação que você usa."
        },
        {
            "type": "choose",
            "question": "Qual é um caso de uso para implementar políticas de barreiras de informação no Microsoft 365?",
            "statements": [
                {
                    "title": "restringir o acesso não autenticado ao Microsoft 365",
                    "isCorrect": false
                },
                {
                    "title": "restringir chats do Microsoft Teams entre determinados grupos dentro de uma organização",
                    "isCorrect": true
                },
                {
                    "title": "restringir emails do Microsoft Exchange Online entre determinados grupos dentro de uma organização",
                    "isCorrect": false
                },
                {
                    "title": "restringir o compartilhamento de dados com destinatários externos de email",
                    "isCorrect": false
                }
            ],
            "explanation": "As barreiras de informação são suportadas no Microsoft Teams, SharePoint Online e OneDrive for Business. Um administrador de conformidade ou administrador de barreiras de informação pode definir políticas para permitir ou impedir comunicações entre grupos de usuários no Microsoft Teams. Políticas de barreiras de informação podem ser usadas para situações como essas."
        },        
        {
            "type": "choose",
            "question": "O que você pode usar para implantar recursos do Azure em várias assinaturas de maneira consistente?",
            "statements": [
                {
                    "title": "Microsoft Defender para Nuvem",
                    "isCorrect": false
                },
                {
                    "title": "Azure Blueprints",
                    "isCorrect": true
                },
                {
                    "title": "Microsoft Sentinel",
                    "isCorrect": false
                },
                {
                    "title": "Azure Policy",
                    "isCorrect": false
                }
            ],
            "explanation": "O Azure Blueprints permite definir um conjunto repetível de recursos do Azure que implementa e adere aos padrões, padrões e requisitos de uma organização. O Azure Blueprints permite que as equipes de desenvolvimento criem e implantem rapidamente novos ambientes, sabendo que estão usando um conjunto de componentes integrados que podem acelerar o desenvolvimento e a entrega."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Com a Auditoria Avançada no Microsoft 365, você pode identificar quando itens de email foram acessados.",
                    "isCorrect": true
                },
                {
                    "title": "A Auditoria Avançada no Microsoft 365 suporta o mesmo período de retenção de logs de auditoria que a auditoria básica.",
                    "isCorrect": false
                },
                {
                    "title": "A Auditoria Avançada no Microsoft 365 aloca largura de banda dedicada ao cliente para acessar dados de auditoria.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Sim - O evento MailltemsAccessed é uma ação de auditoria de caixa de correio e é acionado quando os dados de email são acessados por protocolos de email e clientes de email.\n\nBox 2: Não - A Auditoria Básica retém registros de auditoria por 90 dias. A Auditoria Avançada retém todos os registros de auditoria do Exchange, SharePoint e Azure Active Directory por um ano. Isso é realizado por uma política padrão de retenção de logs de auditoria que retém qualquer registro de auditoria que contenha o valor Exchange, SharePoint ou AzureActive Directory para a propriedade Workload (que indica o serviço no qual a atividade ocorreu) por um ano.\n\nBox 3: Sim - A Auditoria Avançada no Microsoft 365 fornece acesso de alta largura de banda à API de Atividade de Gerenciamento do Office 365."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "A Proteção de Identidade do Azure Active Directory (Azure AD) pode adicionar usuários a grupos com base no nível de risco dos usuários.",
                    "isCorrect": false
                },
                {
                    "title": "A Proteção de Identidade do Azure Active Directory (Azure AD) pode detectar se as credenciais do usuário foram vazadas para o público.",
                    "isCorrect": true
                },
                {
                    "title": "A Proteção de Identidade do Azure Active Directory (Azure AD) pode ser usada para invocar a Autenticação Multifator com base no nível de risco de um usuário.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Não - A Proteção de Identidade do Azure AD não pode adicionar usuários a grupos com base no nível de risco. Box 2: Sim - Credenciais Vazadas indica que as credenciais válidas do usuário foram vazadas. Box 3: Sim - A Autenticação Multifator pode ser exigida com base em condições, uma das quais é o risco do usuário."
        },
        {
            "type": "choose",
            "question": "Qual recurso do centro de conformidade do Microsoft 365 você pode usar para identificar todos os documentos em um site do Microsoft SharePoint Online que contêm uma palavra-chave específica?",
            "statements": [
                {
                    "title": "Auditoria",
                    "isCorrect": false
                },
                {
                    "title": "Compliance Manager",
                    "isCorrect": false
                },
                {
                    "title": "Busca de Conteúdo",
                    "isCorrect": true
                },
                {
                    "title": "Alertas",
                    "isCorrect": false
                }
            ],
            "explanation": "A ferramenta Busca de Conteúdo no Centro de Segurança e Conformidade pode ser usada para encontrar rapidamente emails em caixas de correio do Exchange, documentos em sites do SharePoint e locais do OneDrive, e conversas de mensagens instantâneas no Skype for Business. O primeiro passo é começar a usar a ferramenta de Busca de Conteúdo para escolher locais de conteúdo para busca e configurar uma consulta de palavra-chave para buscar itens específicos."
        },
        {
            "type": "select",
            "question": "fornece um local central para gerenciar proteção de informações, governança de informações e políticas de prevenção contra perda de dados (DLP).",
            "statements": [
                {
                    "title": "Azure Defender",
                    "isCorrect": false
                },
                {
                    "title": "O centro de conformidade do Microsoft 365",
                    "isCorrect": true
                },
                {
                    "title": "O portal do Microsoft Defender",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Endpoint Manager",
                    "isCorrect": false
                }
            ],
            "explanation": "Eles mudaram o nome para portal de conformidade Microsoft Purview."
        },
        {
            "type": "choose",
            "question": "Qual recurso do Microsoft 365 você pode usar para restringir os usuários de enviar mensagens de email que contêm listas de clientes e seus números de cartão de crédito associados?",
            "statements": [
                {
                    "title": "políticas de retenção",
                    "isCorrect": false
                },
                {
                    "title": "políticas de prevenção contra perda de dados (DLP)",
                    "isCorrect": true
                },
                {
                    "title": "políticas de acesso condicional",
                    "isCorrect": false
                },
                {
                    "title": "barreiras de informação",
                    "isCorrect": false
                }
            ],
            "explanation": "As políticas de prevenção contra perda de dados (DLP) no Microsoft 365 ajudam a detectar e restringir o compartilhamento de informações sensíveis, como números de cartões de crédito, e podem impedir que os usuários enviem essas informações via email ou outros canais de comunicação."
        },        
        {
            "type": "select",
            "question": "pode ser usado para fornecer acesso aos Engenheiros de Suporte da Microsoft aos dados de uma organização armazenados no Microsoft Exchange Online, SharePoint Online e OneDrive for Business.",
            "statements": [
                {
                    "title": "Customer Lockbox",
                    "isCorrect": true
                },
                {
                    "title": "Barreiras de Informação",
                    "isCorrect": false
                },
                {
                    "title": "Gerenciamento de Acesso Privilegiado (PAM)",
                    "isCorrect": false
                },
                {
                    "title": "Rótulos de Sensibilidade",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "Em um fluxo de trabalho de Descoberta Básica (Core Discovery), o que você deve fazer antes de poder pesquisar conteúdo?",
            "statements": [
                {
                    "title": "Criar uma retenção de Descoberta.",
                    "isCorrect": true
                },
                {
                    "title": "Executar Análise Rápida.",
                    "isCorrect": false
                },
                {
                    "title": "Configurar a detecção de privilégio advogado-cliente.",
                    "isCorrect": false
                },
                {
                    "title": "Exportar e baixar resultados.",
                    "isCorrect": false
                }
            ],
            "explanation": "Criar uma retenção de Descoberta. O primeiro passo após criar um caso é colocar uma retenção (também chamada de retenção de Descoberta) nos locais de conteúdo das pessoas de interesse em sua investigação. ... Embora este passo seja opcional, ..."
        },
        {
            "type": "choose",
            "question": "Qual portal da Microsoft fornece informações sobre como a Microsoft gerencia privacidade, conformidade e segurança?",
            "statements": [
                {
                    "title": "Microsoft Service Trust Portal",
                    "isCorrect": true
                },
                {
                    "title": "Compliance Manager",
                    "isCorrect": false
                },
                {
                    "title": "Centro de conformidade do Microsoft 365",
                    "isCorrect": false
                },
                {
                    "title": "Suporte da Microsoft",
                    "isCorrect": false
                }
            ],
            "explanation": "O Microsoft Service Trust Portal fornece uma variedade de conteúdos, ferramentas e outros recursos sobre práticas de segurança, privacidade e conformidade da Microsoft."
        },
        {
            "type": "choose",
            "question": "O que você pode proteger usando a solução de proteção de informações no centro de conformidade do Microsoft 365?",
            "statements": [
                {
                    "title": "computadores contra exploits de dia zero",
                    "isCorrect": false
                },
                {
                    "title": "usuários contra tentativas de phishing",
                    "isCorrect": false
                },
                {
                    "title": "arquivos contra malware e vírus",
                    "isCorrect": false
                },
                {
                    "title": "dados confidenciais de serem expostos a usuários não autorizados",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "O que você pode especificar nos rótulos de sensibilidade do Microsoft 365?",
            "statements": [
                {
                    "title": "por quanto tempo os arquivos devem ser preservados",
                    "isCorrect": false
                },
                {
                    "title": "quando arquivar uma mensagem de email",
                    "isCorrect": false
                },
                {
                    "title": "qual marca d'água adicionar aos arquivos",
                    "isCorrect": true
                },
                {
                    "title": "onde armazenar arquivos",
                    "isCorrect": false
                }
            ],
            "explanation": "Criando classificação para informações/dados sensíveis"
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Você pode usar a Auditoria Avançada no Microsoft 365 para visualizar detalhes de faturamento.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode usar a Auditoria Avançada no Microsoft 365 para visualizar o conteúdo de uma mensagem de email.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode usar a Auditoria Avançada no Microsoft 365 para identificar quando um usuário usa a barra de pesquisa no Outlook na web para buscar itens em uma caixa de correio.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Não - A Auditoria Avançada ajuda as organizações a conduzirem investigações forenses e de conformidade aumentando a retenção de logs de auditoria.\n\nBox 2: Não - \n\nBox 3: Sim - O evento de Envio (Send) também é uma ação de auditoria de caixa de correio e é acionado quando um usuário realiza uma das seguintes ações: envia uma mensagem de email, responde a uma mensagem de email, encaminha uma mensagem de email. Investigadores podem usar o evento de Envio para identificar emails enviados de uma conta comprometida. O registro de auditoria para um evento de Envio contém informações sobre a mensagem, como quando a mensagem foi enviada, o ID da mensagem da Internet, a linha de assunto e se a mensagem continha anexos. Essas informações de auditoria podem ajudar investigadores a identificar informações sobre mensagens de email enviadas de uma conta comprometida ou enviadas por um invasor. Além disso, investigadores podem usar uma ferramenta de Descoberta do Microsoft 365 para buscar a mensagem (usando a linha de assunto ou o ID da mensagem) para identificar os destinatários para os quais a mensagem foi enviada e o conteúdo real da mensagem enviada."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Você pode adicionar um bloqueio de recurso a uma assinatura do Azure.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode adicionar apenas um bloqueio de recurso a um recurso do Azure.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode excluir um grupo de recursos contendo recursos que têm bloqueios de recurso.",
                    "isCorrect": false
                }
            ],
            "explanation": "Se você tiver um bloqueio de exclusão em um recurso e tentar excluir seu grupo de recursos, toda a operação de exclusão será bloqueada. Mesmo que o grupo de recursos ou outros recursos no grupo de recursos não estejam bloqueados, a exclusão não acontece. Você nunca tem uma exclusão parcial. Fonte: https://docs.microsoft.com/pt-br/azure/azure-resource-manager/management/lock-resources?tabs=json"
        },        
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Os usuários podem aplicar rótulos de sensibilidade manualmente.",
                    "isCorrect": true
                },
                {
                    "title": "Múltiplos rótulos de sensibilidade podem ser aplicados ao mesmo arquivo.",
                    "isCorrect": false
                },
                {
                    "title": "Um rótulo de sensibilidade pode aplicar uma marca d'água a um documento do Microsoft Word.",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "Quais duas tarefas você pode implementar usando políticas de prevenção contra perda de dados (DLP) no Microsoft 365? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "Exibir dicas de política para usuários que estão prestes a violar as políticas da sua organização.",
                    "isCorrect": true
                },
                {
                    "title": "Habilitar criptografia de disco em endpoints.",
                    "isCorrect": false
                },
                {
                    "title": "Proteger documentos no Microsoft OneDrive que contêm informações sensíveis.",
                    "isCorrect": true
                },
                {
                    "title": "Aplicar padrões de segurança a dispositivos.",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "select",
            "question": "O Compliance Manager avalia os dados de conformidade ... para uma organização.",
            "statements": [
                {
                    "title": "continuamente",
                    "isCorrect": true
                },
                {
                    "title": "mensalmente",
                    "isCorrect": false
                },
                {
                    "title": "sob demanda",
                    "isCorrect": false
                },
                {
                    "title": "trimestralmente",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Os rótulos de sensibilidade podem ser usados para criptografar documentos.",
                    "isCorrect": true
                },
                {
                    "title": "Os rótulos de sensibilidade podem adicionar cabeçalhos e rodapés aos documentos.",
                    "isCorrect": true
                },
                {
                    "title": "Os rótulos de sensibilidade podem aplicar marcas d'água a emails.",
                    "isCorrect": false
                }
            ],
            "explanation": "Box 1: Sim - Você pode usar rótulos de sensibilidade para fornecer configurações de proteção que incluem a criptografia de emails e documentos para impedir que pessoas não autorizadas acessem esses dados.\n\nBox 2: Sim - Você pode usar rótulos de sensibilidade para marcar o conteúdo quando usar aplicativos do Office, adicionando marcas d'água, cabeçalhos ou rodapés a documentos que tenham o rótulo aplicado.\n\nBox 3: Não - Porque você não pode aplicar marca d'água a um email, apenas a documentos no Word, Excel e PowerPoint. Fonte: https://docs.microsoft.com/pt-br/information-protection/deploy-use/configure-policy-markings"
        },
        {
            "type": "choose",
            "question": "Qual recurso de conformidade do Microsoft 365 você pode usar para criptografar conteúdo automaticamente com base em condições específicas?",
            "statements": [
                {
                    "title": "Busca de Conteúdo",
                    "isCorrect": false
                },
                {
                    "title": "rótulos de sensibilidade",
                    "isCorrect": true
                },
                {
                    "title": "políticas de retenção",
                    "isCorrect": false
                },
                {
                    "title": "Descoberta",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Compliance Manager rastreia apenas controles gerenciados pelo cliente.",
                    "isCorrect": false
                },
                {
                    "title": "O Compliance Manager fornece templates predefinidos para criar avaliações.",
                    "isCorrect": true
                },
                {
                    "title": "O Compliance Manager pode ajudar você a avaliar se os dados aderem a padrões específicos de proteção de dados.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Não - O Compliance Manager rastreia controles gerenciados pela Microsoft, controles gerenciados pelo cliente e controles compartilhados.\n\nBox 2: Sim - \n\nBox 3: Sim - O Compliance Manager pode ajudar você a avaliar se os dados aderem a padrões específicos de proteção de dados."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Você pode usar a solução de gerenciamento de riscos internos para detectar golpes de phishing.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode acessar a solução de gerenciamento de riscos internos a partir do centro de conformidade do Microsoft 365.",
                    "isCorrect": true
                },
                {
                    "title": "Você pode usar a solução de gerenciamento de riscos internos para detectar vazamentos de dados por funcionários insatisfeitos.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Não - Golpes de phishing são ameaças externas.\n\nBox 2: Sim - O gerenciamento de riscos internos é uma solução de conformidade no Microsoft 365.\n\nBox 3: Sim - O gerenciamento de riscos internos ajuda a minimizar os riscos internos dos usuários. Isso inclui:\n - Vazamentos de dados sensíveis e derramamento de dados\n - Violações de confidencialidade\n - Roubo de propriedade intelectual (PI)\n - Fraude\n - Negociação com informações privilegiadas\n - Violações de conformidade regulatória."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Azure Policy suporta remediação automática.",
                    "isCorrect": true
                },
                {
                    "title": "O Azure Policy pode ser usado para garantir que novos recursos adiram aos padrões corporativos.",
                    "isCorrect": true
                },
                {
                    "title": "A avaliação de conformidade no Azure Policy ocorre apenas quando um recurso-alvo é criado ou modificado.",
                    "isCorrect": false
                }
            ],
            "explanation": "Box 1: Sim - O Azure Policy suporta remediação automática usando uma identidade gerenciada para cada atribuição.\n\nBox 2: Sim - O Azure Policy pode impor regras e efeitos sobre seus recursos para garantir que estejam em conformidade com seus padrões corporativos.\n\nBox 3: Não - A avaliação de conformidade no Azure Policy ocorre não apenas quando um recurso é criado ou modificado, mas também em intervalos regulares."
        },        
        {
            "type": "choose",
            "question": "Quais dois cartões estão disponíveis no portal do Microsoft 365 Defender? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "Dispositivos em risco",
                    "isCorrect": true
                },
                {
                    "title": "Pontuação de Conformidade",
                    "isCorrect": true
                },
                {
                    "title": "Saúde do Serviço",
                    "isCorrect": false
                },
                {
                    "title": "Gerenciamento de Usuários",
                    "isCorrect": false
                },
                {
                    "title": "Usuários em risco",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "O que você deve usar para garantir que os membros de um grupo do Azure Active Directory usem a autenticação multifator (MFA) ao fazer login?",
            "statements": [
                {
                    "title": "Controle de acesso baseado em função do Azure (Azure RBAC)",
                    "isCorrect": false
                },
                {
                    "title": "Gerenciamento de Identidade com Privilégios (PIM) do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "Proteção de Identidade do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "uma política de acesso condicional",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "A Proteção de Identidade do Azure Active Directory (Azure AD) gera detecções de risco uma vez que um usuário é autenticado.",
                    "isCorrect": true
                },
                {
                    "title": "A Proteção de Identidade do Azure Active Directory (Azure AD) atribui um nível de risco Baixo, Médio ou Alto a cada evento de risco.",
                    "isCorrect": true
                },
                {
                    "title": "Um risco de usuário na Proteção de Identidade do Azure Active Directory (Azure AD) representa a probabilidade de que uma determinada identidade ou conta esteja comprometida.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Sim - A Proteção de Identidade gera detecções de risco apenas quando as credenciais corretas são usadas. Se credenciais incorretas forem usadas em um login, isso não representa risco de comprometimento de credenciais.\n\nBox 2: Sim - A Proteção de Identidade categoriza o risco em três níveis: baixo, médio e alto. Ao configurar políticas de proteção de identidade, você também pode configurá-la para disparar em um nível de risco Nenhum. Nenhum Risco significa que não há indicação ativa de que a identidade do usuário foi comprometida.\n\nBox 3: Sim - Cada nível de risco traz maior confiança de que o usuário ou login está comprometido. Por exemplo, algo como uma instância de propriedades de login desconhecidas para um usuário pode não ser tão ameaçador quanto credenciais vazadas para outro usuário."
        },
        {
            "type": "choose",
            "question": "Você precisa manter uma cópia de todos os arquivos em um site do Microsoft SharePoint por um ano, mesmo que os usuários excluam os arquivos do site. O que você deve aplicar ao site?",
            "statements": [
                {
                    "title": "uma política de retenção",
                    "isCorrect": true
                },
                {
                    "title": "uma política de risco interno",
                    "isCorrect": false
                },
                {
                    "title": "uma política de prevenção contra perda de dados (DLP)",
                    "isCorrect": false
                },
                {
                    "title": "uma política de rótulos de sensibilidade",
                    "isCorrect": false
                }
            ],
            "explanation": "Para manter uma cópia de todos os arquivos em um site do Microsoft SharePoint por um ano, mesmo que os usuários excluam os arquivos do site, você deve aplicar uma política de retenção."
        },
        {
            "type": "choose",
            "question": "Você precisa criar uma política de prevenção contra perda de dados (DLP). O que você deve usar?",
            "statements": [
                {
                    "title": "o centro de conformidade do Microsoft 365",
                    "isCorrect": true
                },
                {
                    "title": "o centro de administração do Microsoft Endpoint Manager",
                    "isCorrect": false
                },
                {
                    "title": "o centro de administração do Microsoft 365",
                    "isCorrect": false
                },
                {
                    "title": "o portal do Microsoft 365 Defender",
                    "isCorrect": false
                }
            ],
            "explanation": "Você pode configurar políticas de DLP para todas as cargas de trabalho através do portal de conformidade Microsoft Purview."
        },
        {
            "type": "choose",
            "question": "O que é uma avaliação no Compliance Manager?",
            "statements": [
                {
                    "title": "Uma iniciativa de política que inclui várias políticas.",
                    "isCorrect": false
                },
                {
                    "title": "Um dicionário de palavras que não são permitidas em documentos da empresa.",
                    "isCorrect": false
                },
                {
                    "title": "Um agrupamento de controles de uma regulamentação, norma ou política específica.",
                    "isCorrect": true
                },
                {
                    "title": "Orientação recomendada para ajudar as organizações a se alinharem com seus padrões corporativos.",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "O que você pode usar para visualizar a Pontuação de Segurança da Microsoft para Dispositivos?",
            "statements": [
                {
                    "title": "Microsoft Defender para Aplicativos em Nuvem",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Endpoint",
                    "isCorrect": true
                },
                {
                    "title": "Microsoft Defender para Identidade",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Defender para Office 365",
                    "isCorrect": false
                }
            ],
            "explanation": "Sua pontuação para dispositivos é visível no painel de Gerenciamento de Vulnerabilidade do Defender no portal do Microsoft 365 Defender. Encaminhe sinais do Microsoft Defender para Endpoint, dando visibilidade à Pontuação de Segurança da Microsoft sobre a postura de segurança do dispositivo. Portanto, MS Defender para Endpoint, e MS 365 defender (se encaminhado). Mas NÃO Defender para 0365."
        },        
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Cada regra do grupo de segurança de rede (NSG) deve ter um nome exclusivo.",
                    "isCorrect": true
                },
                {
                    "title": "As regras padrão do grupo de segurança de rede (NSG) podem ser excluídas.",
                    "isCorrect": false
                },
                {
                    "title": "As regras do grupo de segurança de rede (NSG) podem ser configuradas para verificar os tipos de protocolo de rede TCP, UDP ou ICMP.",
                    "isCorrect": true
                }
            ],
            "explanation": "Box 1: Sim - As regras de segurança devem ter um nome exclusivo dentro do grupo de segurança de rede (NSG).\n\nBox 2: Não - Você não pode remover as regras padrão, mas pode substituí-las criando regras com prioridades mais altas.\n\nBox 3: Sim - As regras do NSG podem ser configuradas para verificar os tipos de protocolo de rede TCP, UDP ou ICMP."
        },
        {
            "type": "select",
            "question": "Quando os usuários tentam acessar um aplicativo ou serviço, ... controla seu nível de acesso.",
            "statements": [
                {
                    "title": "administração",
                    "isCorrect": false
                },
                {
                    "title": "auditoria",
                    "isCorrect": false
                },
                {
                    "title": "autenticação",
                    "isCorrect": false
                },
                {
                    "title": "autorização",
                    "isCorrect": true
                }
            ],
            "explanation": "Você pode memorizar simplesmente: authENTicação = ENTRAR = posso entrar? authoRização = DIREITOS = onde eu posso ir então?"
        },
        {
            "type": "choose",
            "question": "De que os clientes são responsáveis ao avaliar a segurança em um modelo de serviços de nuvem de software como serviço (SaaS)?",
            "statements": [
                {
                    "title": "sistemas operacionais",
                    "isCorrect": false
                },
                {
                    "title": "controles de rede",
                    "isCorrect": false
                },
                {
                    "title": "aplicativos",
                    "isCorrect": false
                },
                {
                    "title": "contas e identidades",
                    "isCorrect": true
                }
            ],
            "explanation": "É um modelo de serviços de nuvem SaaS, então a empresa é responsável apenas por contas e identidades."
        },
        {
            "type": "select",
            "question": "... fornece capacidades de logon único (SSO) entre vários provedores de identidade.",
            "statements": [
                {
                    "title": "Um controlador de domínio",
                    "isCorrect": false
                },
                {
                    "title": "Serviços de Domínio do Active Directory (AD DS)",
                    "isCorrect": false
                },
                {
                    "title": "Gerenciamento de Identidade com Privilégios (PIM) do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "Federação",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "select",
            "question": "Em um ambiente que possui recursos locais e recursos em nuvem, _______ deve ser o perímetro de segurança principal.",
            "statements": [
                {
                    "title": "a nuvem",
                    "isCorrect": false
                },
                {
                    "title": "um firewall",
                    "isCorrect": false
                },
                {
                    "title": "identidade",
                    "isCorrect": true
                },
                {
                    "title": "Microsoft Defender para Nuvem",
                    "isCorrect": false
                }
            ],
            "explanation": "Muitos consideram a identidade como o perímetro principal para a segurança. Esta é uma mudança do foco tradicional na segurança de rede. Prática recomendada: Centralizar controles e detecções de segurança em torno de identidades de usuários e serviços. Use o Azure AD para colocar controles e identidades juntos."
        },
        {
            "type": "choose",
            "question": "O que o Acesso Condicional avalia usando a Proteção de Identidade do Azure Active Directory (Azure AD)?",
            "statements": [
                {
                    "title": "ações do usuário",
                    "isCorrect": false
                },
                {
                    "title": "associação a grupos",
                    "isCorrect": false
                },
                {
                    "title": "conformidade do dispositivo",
                    "isCorrect": false
                },
                {
                    "title": "risco do usuário",
                    "isCorrect": true
                }
            ],
            "explanation": "A Proteção de Identidade do Azure AD avalia o risco do usuário, que inclui fatores como uso de endereço IP anônimo, viagem atípica, endereço IP vinculado a malware, propriedades de login desconhecidas, credenciais vazadas e pulverização de senha."
        },
        {
            "type": "choose",
            "question": "Qual afirmação representa um princípio de privacidade da Microsoft?",
            "statements": [
                {
                    "title": "A Microsoft gerencia as configurações de privacidade para seus clientes.",
                    "isCorrect": false
                },
                {
                    "title": "A Microsoft respeita as leis de privacidade locais aplicáveis aos seus clientes.",
                    "isCorrect": true
                },
                {
                    "title": "A Microsoft usa dados de email e chat hospedados de clientes para publicidade direcionada.",
                    "isCorrect": false
                },
                {
                    "title": "A Microsoft não coleta nenhum dado de cliente.",
                    "isCorrect": false
                }
            ],
            "explanation": "A Microsoft respeita as leis de privacidade locais aplicáveis aos seus clientes e luta pela proteção legal da privacidade como um direito humano fundamental."
        },        
        {
            "type": "select",
            "question": "...sistema é uma ferramenta que coleta dados de vários sistemas, identifica correlações ou anomalias e gera alertas e incidentes.",
            "statements": [
                {
                    "title": "Um sistema de gerenciamento de eventos e informações de segurança (SIEM)",
                    "isCorrect": true
                },
                {
                    "title": "Uma resposta automatizada de orquestração de segurança (SOAR)",
                    "isCorrect": false
                },
                {
                    "title": "Uma Troca Automatizada e Confiável de Informações sobre Indicadores (TAXII)",
                    "isCorrect": false
                },
                {
                    "title": "Uma redução da superfície de ataque (ASR)",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "select",
            "question": "Microsoft Sentinel ... usa Azure Logic Apps para automatizar e orquestrar respostas a alertas.",
            "statements": [
                {
                    "title": "regras analíticas",
                    "isCorrect": false
                },
                {
                    "title": "consultas de caça",
                    "isCorrect": false
                },
                {
                    "title": "playbooks",
                    "isCorrect": true
                },
                {
                    "title": "workbooks",
                    "isCorrect": false
                }
            ],
            "explanation": "Os playbooks são coleções de procedimentos que podem ser executados no Microsoft Sentinel em resposta a um alerta ou incidente. Um playbook pode ajudar a automatizar e orquestrar sua resposta e pode ser configurado para ser executado automaticamente quando alertas ou incidentes específicos são gerados, sendo anexado a uma regra analítica ou a uma regra de automação, respectivamente. Também pode ser executado manualmente sob demanda."
        },
        {
            "type": "choose",
            "question": "Qual recurso de conformidade você deve usar para identificar documentos que são currículos de funcionários?",
            "statements": [
                {
                    "title": "classificadores pré-treinados",
                    "isCorrect": true
                },
                {
                    "title": "Explorador de atividades",
                    "isCorrect": false
                },
                {
                    "title": "eDiscovery",
                    "isCorrect": false
                },
                {
                    "title": "Explorador de conteúdo",
                    "isCorrect": false
                }
            ],
            "explanation": "Classificadores pré-treinados são usados para identificar documentos que são currículos de funcionários. Fonte: https://learn.microsoft.com/pt-br/microsoft-365/compliance/classifier-tc-definitions?view=o365-worldwide#resume"
        },
        {
            "type": "choose",
            "question": "Qual pilar de identidade está relacionado ao rastreamento dos recursos acessados por um usuário?",
            "statements": [
                {
                    "title": "autorização",
                    "isCorrect": false
                },
                {
                    "title": "auditoria",
                    "isCorrect": true
                },
                {
                    "title": "administração",
                    "isCorrect": false
                },
                {
                    "title": "autenticação",
                    "isCorrect": false
                }
            ],
            "explanation": "A auditoria é correta, pois está relacionada ao rastreamento das atividades e recursos acessados por um usuário."
        },
        {
            "type": "choose",
            "question": "O que pode ser criado nos Serviços de Domínio do Active Directory (AD DS)?",
            "statements": [
                {
                    "title": "aplicativos de linha de negócios (LOB) que exigem autenticação moderna",
                    "isCorrect": false
                },
                {
                    "title": "contas de computador",
                    "isCorrect": true
                },
                {
                    "title": "aplicativos de software como serviço (SaaS) que exigem autenticação moderna",
                    "isCorrect": false
                },
                {
                    "title": "dispositivos móveis",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "select",
            "question": "Quando os usuários fazem login, _______ verifica suas credenciais para provar sua identidade.",
            "statements": [
                {
                    "title": "administração",
                    "isCorrect": false
                },
                {
                    "title": "auditoria",
                    "isCorrect": false
                },
                {
                    "title": "autenticação",
                    "isCorrect": true
                },
                {
                    "title": "autorização",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "A autorização é usada para identificar o nível de acesso a um recurso.",
                    "isCorrect": true
                },
                {
                    "title": "A autenticação está provando que os usuários são quem dizem ser.",
                    "isCorrect": true
                },
                {
                    "title": "A autenticação identifica se você pode ler e escrever em um arquivo.",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "Qual é uma função dos controles de sessão de Acesso Condicional?",
            "statements": [
                {
                    "title": "aplicar conformidade de dispositivo",
                    "isCorrect": false
                },
                {
                    "title": "aplicar conformidade de aplicativo cliente",
                    "isCorrect": false
                },
                {
                    "title": "habilitar experiências limitadas, como bloquear o download de informações sensíveis",
                    "isCorrect": true
                },
                {
                    "title": "solicitar autenticação multifator (MFA)",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },        
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "A Proteção de Identidade do Azure AD pode adicionar usuários a grupos com base no nível de risco dos usuários.",
                    "isCorrect": false
                },
                {
                    "title": "A Proteção de Identidade do Azure AD pode detectar se as credenciais do usuário foram vazadas para o público.",
                    "isCorrect": true
                },
                {
                    "title": "A Proteção de Identidade do Azure AD pode ser usada para invocar a Autenticação Multifator com base no nível de risco de um usuário.",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "O que você pode usar para garantir que todos os usuários em um grupo específico usem a autenticação multifator (MFA) para fazer login no Azure Active Directory (Azure AD)?",
            "statements": [
                {
                    "title": "Azure Policy",
                    "isCorrect": false
                },
                {
                    "title": "uma política de conformidade de comunicação",
                    "isCorrect": false
                },
                {
                    "title": "uma política de Acesso Condicional",
                    "isCorrect": true
                },
                {
                    "title": "uma política de risco de usuário",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Você pode criar uma identidade híbrida em um Active Directory local que sincroniza com o Azure AD.",
                    "isCorrect": true
                },
                {
                    "title": "As contas de usuário criadas no Azure AD sincronizam automaticamente com um Active Directory local.",
                    "isCorrect": false
                },
                {
                    "title": "Ao usar um modelo híbrido, a autenticação pode ser feita pelo Azure AD ou por outro provedor de identidade.",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "Quais três métodos de autenticação os usuários do Azure AD podem usar para redefinir sua senha? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "notificação de aplicativo móvel",
                    "isCorrect": true
                },
                {
                    "title": "mensagem de texto para um telefone",
                    "isCorrect": true
                },
                {
                    "title": "perguntas de segurança",
                    "isCorrect": true
                },
                {
                    "title": "certificado",
                    "isCorrect": false
                },
                {
                    "title": "senha com imagem",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Azure AD B2C permite que usuários externos façam login usando suas identidades de conta social ou corporativa preferidas.",
                    "isCorrect": true
                },
                {
                    "title": "Os usuários externos do Azure AD B2C são gerenciados no mesmo diretório que os usuários na organização do Azure AD.",
                    "isCorrect": false
                },
                {
                    "title": "A personalização de marca pode ser aplicada à autenticação do Azure AD B2C.",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Tokens de software são um exemplo de autenticação sem senha.",
                    "isCorrect": false
                },
                {
                    "title": "O Windows Hello é um exemplo de autenticação sem senha.",
                    "isCorrect": true
                },
                {
                    "title": "Chaves de segurança FIDO2 são um exemplo de autenticação sem senha.",
                    "isCorrect": true
                }
            ],
            "explanation": "Cada organização tem diferentes necessidades quando se trata de autenticação. O Azure global da Microsoft e o Azure Government oferecem as seguintes três opções de autenticação sem senha que se integram ao Azure Active Directory (Azure AD):\n\n- Windows Hello para Empresas\n- Microsoft Authenticator\n- Chaves de segurança FIDO2. Fonte: https://learn.microsoft.com/pt-br/azure/active-directory/authentication/concept-authentication-passwordless"
        },        
        {
            "type": "choose",
            "question": "Qual recurso de segurança está disponível no modo gratuito do Microsoft Defender para Nuvem?",
            "statements": [
                {
                    "title": "alertas de proteção contra ameaças",
                    "isCorrect": false
                },
                {
                    "title": "acesso just-in-time (JIT) a máquinas virtuais do Azure",
                    "isCorrect": false
                },
                {
                    "title": "verificação de vulnerabilidades de máquinas virtuais",
                    "isCorrect": false
                },
                {
                    "title": "pontuação de segurança",
                    "isCorrect": true
                }
            ],
            "explanation": "A pontuação de segurança está disponível no modo gratuito do Microsoft Defender para Nuvem."
        },
        {
            "type": "choose",
            "question": "O Microsoft 365 Endpoint data loss prevention (Endpoint DLP) pode ser usado em quais sistemas operacionais?",
            "statements": [
                {
                    "title": "Windows 10 e versões mais recentes apenas",
                    "isCorrect": false
                },
                {
                    "title": "Windows 10 e versões mais recentes e Android apenas",
                    "isCorrect": false
                },
                {
                    "title": "Windows 10 e versões mais recentes e iOS apenas",
                    "isCorrect": false
                },
                {
                    "title": "Windows 10 e versões mais recentes, Android e iOS",
                    "isCorrect": true
                }
            ],
            "explanation": "O Endpoint DLP pode ser usado em Windows 10 e versões mais recentes, Android e iOS."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Microsoft Defender para Nuvem pode detectar vulnerabilidades e ameaças para o Azure Storage.",
                    "isCorrect": true
                },
                {
                    "title": "O Cloud Security Posture Management (CSPM) está disponível para todas as assinaturas do Azure.",
                    "isCorrect": true
                },
                {
                    "title": "O Microsoft Defender para Nuvem pode avaliar a segurança das cargas de trabalho implantadas no Azure ou no local.",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "select",
            "question": "é um serviço em nuvem para armazenar ... segredos de aplicativos.",
            "statements": [
                {
                    "title": "Proteção de Senha do Azure Active Directory (Azure AD)",
                    "isCorrect": false
                },
                {
                    "title": "Azure Bastion",
                    "isCorrect": false
                },
                {
                    "title": "Azure Information Protection (AIP)",
                    "isCorrect": false
                },
                {
                    "title": "Azure Key Vault",
                    "isCorrect": true
                }
            ],
            "explanation": ""
        },
        {
            "type": "select",
            "question": "... fornece proteção de carga de trabalho em nuvem para recursos do Azure e nuvem híbrida.",
            "statements": [
                {
                    "title": "Microsoft Defender para Nuvem",
                    "isCorrect": true
                },
                {
                    "title": "Azure Monitor",
                    "isCorrect": false
                },
                {
                    "title": "Azure Security Benchmark",
                    "isCorrect": false
                },
                {
                    "title": "Pontuação de Segurança da Microsoft",
                    "isCorrect": false
                }
            ],
            "explanation": ""
        },
        {
            "type": "choose",
            "question": "Qual é o número máximo de recursos que a Proteção DDoS Padrão do Azure pode proteger sem custos adicionais?",
            "statements": [
                {
                    "title": "50",
                    "isCorrect": false
                },
                {
                    "title": "100",
                    "isCorrect": true
                },
                {
                    "title": "500",
                    "isCorrect": false
                },
                {
                    "title": "1000",
                    "isCorrect": false
                }
            ],
            "explanation": "Os planos de proteção contra DDoS têm uma taxa mensal fixa que cobre até 100 endereços IP públicos. A proteção para recursos adicionais está disponível. Fonte: https://learn.microsoft.com/pt-br/azure/ddos-protection/ddos-faq#how-does-pricing-work"
        },
        {
            "type": "choose",
            "question": "Quais são dois motivos para implantar várias redes virtuais em vez de usar apenas uma rede virtual? Cada resposta correta apresenta uma solução completa.",
            "statements": [
                {
                    "title": "para atender às políticas de governança",
                    "isCorrect": true
                },
                {
                    "title": "para conectar vários tipos de recursos",
                    "isCorrect": false
                },
                {
                    "title": "para separar os recursos para orçamento",
                    "isCorrect": false
                },
                {
                    "title": "para isolar os recursos",
                    "isCorrect": true
                }
            ],
            "explanation": "Os principais motivos para a segmentação são:\n- A capacidade de agrupar ativos relacionados que são parte (ou suportam) operações de carga de trabalho.\n- Isolamento de recursos.\n- Políticas de governança definidas pela organização. Fonte: https://learn.microsoft.com/pt-br/azure/architecture/framework/security/design-network-segmentation"
        },        
        {
            "type": "select",
            "question": "O Microsoft Sentinel fornece insights rápidos sobre dados usando ...",
            "statements": [
                {
                    "title": "Azure Logic Apps.",
                    "isCorrect": false
                },
                {
                    "title": "templates do workbook do Azure Monitor.",
                    "isCorrect": true
                },
                {
                    "title": "Azure Resource Graph Explorer.",
                    "isCorrect": false
                },
                {
                    "title": "playbooks.",
                    "isCorrect": false
                }
            ],
            "explanation": "Os templates do workbook do Azure Monitor são usados no Microsoft Sentinel para fornecer insights rápidos sobre dados."
        },
        {
            "type": "choose",
            "question": "Você tem uma assinatura do Azure que contém vários recursos. Você precisa avaliar a conformidade e impor padrões para os recursos existentes. O que você deve usar?",
            "statements": [
                {
                    "title": "Azure Blueprints",
                    "isCorrect": false
                },
                {
                    "title": "o serviço Anomaly Detector",
                    "isCorrect": false
                },
                {
                    "title": "Microsoft Sentinel",
                    "isCorrect": false
                },
                {
                    "title": "Azure Policy",
                    "isCorrect": true
                }
            ],
            "explanation": "O Azure Policy é usado para avaliar a conformidade e impor padrões para os recursos existentes em uma assinatura do Azure."
        },
        {
            "type": "choose",
            "question": "Qual métrica do Microsoft Defender for Cloud exibe a saúde geral de segurança de uma assinatura do Azure?",
            "statements": [
                {
                    "title": "pontuação de segurança",
                    "isCorrect": true
                },
                {
                    "title": "saúde do recurso",
                    "isCorrect": false
                },
                {
                    "title": "controles concluídos",
                    "isCorrect": false
                },
                {
                    "title": "o status das recomendações",
                    "isCorrect": false
                }
            ],
            "explanation": "A pontuação de segurança é a métrica que exibe a saúde geral de segurança de uma assinatura do Azure. Se o foco fosse em problemas/saúde de recursos, seria 'saúde do recurso', mas para saúde de segurança, é 'pontuação de segurança'."
        },
        {
            "type": "multiple-select",
            "question": [
                "Use criptografia para proteger dados em repouso",
                "Monitore ativamente os sistemas para identificar irregularidades que possam representar riscos"
            ],            
            "explanation": "A criptografia é usada como uma medida preventiva para proteger dados em repouso, garantindo que partes não autorizadas não possam acessar os dados. Monitorar ativamente os sistemas para identificar irregularidades é uma medida detetiva, que ajuda a identificar possíveis incidentes de segurança e tomar medidas oportunas.",
            "statements": [
                {
                    "title": "Corretivo"
                },
                {
                    "title": "Detetivo"
                },
                {
                    "title": "Preventivo"
                }
            ],
            "answers": [
                "Preventivo",
                "Detetivo"
            ]
        },
        {
            "type": "multiple-select",
            "question": [
                "Devem ser segmentados",
                "Devem ser verificados usando autenticação forte",
                "Devem ser classificados, rotulados e criptografados com base em seus atributos"
            ],            
            "explanation": "",
            "statements": [
                {
                    "title": "Dados"
                },
                {
                    "title": "Identidades"
                },
                {
                    "title": "Redes"
                }
            ],
            "answers": [
                "Redes",
                "Identidades",
                "Dados"
            ]
        },
        {
            "type": "multiple-select",
            "question": [
                "Revise e filtre alertas",
                "Crie casos no painel de Casos",
                "Envie um lembrete das políticas corporativas aos usuários"
            ],            
            "explanation": "",
            "statements": [
                {
                    "title": "Ação"
                },
                {
                    "title": "Investigar"
                },
                {
                    "title": "Triagem"
                }
            ],
            "answers": [
                "Triagem",
                "Investigar",
                "Ação"
            ]
        },
        {
            "type": "multiple-select",
            "question": [
                "Fornece inteligência sobre questões prevalentes de cibersegurança",
                "Fornece relatórios em tempo real para identificar e analisar ameaças recentes",
                "Detecta tentativas de personificação"
            ],            
            "explanation": "Prevalente = Trackers | Tempo real = Explorer | Personificação = Anti-phishing",
            "statements": [
                {
                    "title": "Threat Explorer"
                },
                {
                    "title": "Threat Trackers"
                },
                {
                    "title": "Proteção contra phishing"
                }
            ],
            "answers": [
                "Threat Trackers",
                "Threat Explorer",
                "Proteção contra phishing"
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "Você pode usar barreiras de informação com o Microsoft Exchange.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode usar barreiras de informação com o Microsoft SharePoint.",
                    "isCorrect": true
                },
                {
                    "title": "Você pode usar barreiras de informação com o Microsoft Teams.",
                    "isCorrect": true
                }
            ],
            "explanation": "NÃO - https://learn.microsoft.com/pt-br/microsoft-365/compliance/information-barriers?view=o365-worldwide#information-barriers-and-exchange-online\nAtualmente, apenas implantações do Exchange Online são suportadas para políticas de IB. Se sua organização precisar definir e controlar comunicações por email, considere usar regras de fluxo de email do Exchange.\nO Microsoft Purview Information Barriers (IB) é uma solução de conformidade que permite restringir a comunicação e colaboração bidirecional entre grupos e usuários no Microsoft Teams, SharePoint e OneDrive.\nSIM - https://learn.microsoft.com/pt-br/microsoft-365/compliance/information-barriers?view=o365-worldwide\nSIM - https://learn.microsoft.com/pt-br/microsoft-365/compliance/information-barriers?view=o365-worldwide"
        },
        {
            "type": "select",
            "question": "A gestão de risco interno é configurada a partir do...",
            "statements": [
                {
                    "title": "centro de administração do Microsoft 365",
                    "isCorrect": false
                },
                {
                    "title": "centro de conformidade do Microsoft 365",
                    "isCorrect": true
                },
                {
                    "title": "portal do Microsoft 365 Defender",
                    "isCorrect": false
                },
                {
                    "title": "portal do Microsoft Defender para Aplicativos em Nuvem",
                    "isCorrect": false
                }
            ],
            "explanation": "Foi renomeado, então presumo que o exame ainda o rotule como Centro de Conformidade do M365. Apenas lembre-se de que agora é Microsoft Purview."
        },        
        {
            "type": "choose",
            "question": "Você precisa garantir a repetibilidade ao criar novos recursos em uma assinatura do Azure. O que você deve usar?",
            "statements": [
                {
                    "title": "Microsoft Sentinel",
                    "isCorrect": false
                },
                {
                    "title": "Azure Policy",
                    "isCorrect": false
                },
                {
                    "title": "Azure Batch",
                    "isCorrect": false
                },
                {
                    "title": "Azure Blueprints",
                    "isCorrect": true
                }
            ],
            "explanation": "O Azure Blueprints permite que você defina um conjunto repetível de recursos do Azure que implementam e aderem aos padrões, padrões e requisitos de uma organização."
        },
        {
            "type": "choose",
            "question": "Qual é uma característica de um rótulo de sensibilidade no Microsoft 365?",
            "statements": [
                {
                    "title": "criptografado",
                    "isCorrect": false
                },
                {
                    "title": "restrito a categorias predefinidas",
                    "isCorrect": false
                },
                {
                    "title": "persistente",
                    "isCorrect": true
                }
            ],
            "explanation": "Os rótulos de sensibilidade são persistentes, o que significa que as proteções aplicadas acompanham os dados, garantindo que permaneçam seguros independentemente de onde estão armazenados ou com quem são compartilhados."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "O Microsoft Purview fornece classificação de dados sensíveis.",
                    "isCorrect": true
                },
                {
                    "title": "O Microsoft Sentinel é uma solução de gerenciamento do ciclo de vida dos dados.",
                    "isCorrect": false
                },
                {
                    "title": "O Microsoft Purview só pode descobrir dados que estão armazenados no Azure.",
                    "isCorrect": false
                }
            ],
            "explanation": "O Microsoft Purview Data Lifecycle Management anteriormente era chamado de Microsoft Information Governance. Ele ajuda as organizações a gerenciar seu risco através da descoberta, classificação, rotulagem e governança de seus dados. NÃO é o Sentinel."
        },
        {
            "type": "select",
            "question": "... mede o progresso de uma empresa na conclusão de ações que ajudam a reduzir riscos em torno da proteção de dados e padrões regulatórios.",
            "statements": [
                {
                    "title": "Pontuação de conformidade",
                    "isCorrect": true
                },
                {
                    "title": "Relatórios do centro de conformidade do Microsoft 365",
                    "isCorrect": false
                },
                {
                    "title": "O Trust Center",
                    "isCorrect": false
                },
                {
                    "title": "Documentos de confiança",
                    "isCorrect": false
                }
            ],
            "explanation": "A pontuação de conformidade mede o progresso de uma empresa na conclusão de ações que ajudam a reduzir riscos em torno da proteção de dados e padrões regulatórios."
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "A criptografia assimétrica usa um par de chaves pública e privada.",
                    "isCorrect": true
                },
                {
                    "title": "A criptografia simétrica usa um par de chaves pública e privada.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode usar a descriptografia para recuperar o conteúdo original de um hash de conteúdo.",
                    "isCorrect": false
                }
            ],
            "explanation": "A hashificação é diferente da criptografia no sentido de que ela não usa chaves e o valor do hash não é subsequentemente descriptografado de volta ao original. Fonte: https://learn.microsoft.com/pt-br/training/modules/describe-security-concepts-methodologies/5-describe-encryption-hashing"
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "statements": [
                {
                    "title": "A criptografia assimétrica usa um par de chaves pública e privada.",
                    "isCorrect": true
                },
                {
                    "title": "A criptografia simétrica usa um par de chaves pública e privada.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode usar a descriptografia para recuperar o conteúdo original de um hash de conteúdo.",
                    "isCorrect": false
                }
            ],
            "explanation": "A criptografia assimétrica utiliza um par de chaves: uma chave pública para criptografar os dados e uma chave privada para descriptografá-los. A criptografia simétrica utiliza uma única chave para criptografar e descriptografar os dados. A hashificação é diferente da criptografia; ela não utiliza chaves, e o valor do hash não pode ser revertido para o conteúdo original."
        },        
        {
            "type": "select",
            "question": "Garantir que os dados recuperados sejam os mesmos que os dados armazenados é um exemplo de manutenção da...",
            "statements": [
                {
                    "title": "disponibilidade",
                    "isCorrect": false
                },
                {
                    "title": "confidencialidade",
                    "isCorrect": false
                },
                {
                    "title": "integridade",
                    "isCorrect": true
                },
                {
                    "title": "transparência",
                    "isCorrect": false
                }
            ],
            "explanation": "Garantir que os dados não sejam alterados é um exemplo de manutenção da integridade."
        },
        {
            "type": "select",
            "question": "... rastreiam a conformidade com agrupamentos de controles de uma regulamentação ou requisito específico.",
            "statements": [
                {
                    "title": "Avaliações",
                    "isCorrect": true
                },
                {
                    "title": "Ações de melhoria",
                    "isCorrect": false
                },
                {
                    "title": "Soluções",
                    "isCorrect": false
                },
                {
                    "title": "Templates",
                    "isCorrect": false
                }
            ],
            "explanation": "Avaliações rastreiam a conformidade com agrupamentos de controles de uma regulamentação ou requisito específico."
        },        
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "Entender as responsabilidades nos diferentes modelos de serviço em nuvem é crucial para uma gestão eficaz de segurança. Em SaaS, o provedor de nuvem gerencia as atualizações, enquanto em IaaS, o provedor lida com a rede física. As organizações são sempre responsáveis pela segurança de seus dados.",
            "statements": [
                {
                    "title": "Em software como serviço (SaaS), aplicar atualizações de aplicativos é responsabilidade da organização.",
                    "isCorrect": false
                },
                {
                    "title": "Em infraestrutura como serviço (IaaS), gerenciar a rede física é responsabilidade do provedor de nuvem.",
                    "isCorrect": true
                },
                {
                    "title": "Em todos os tipos de implantação de nuvem do Azure, gerenciar a segurança das informações e dos dados é responsabilidade da organização.",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "choose",
            "question": "O que você deve usar para associar a mesma identidade a mais de uma máquina virtual do Azure?",
            "explanation": "Usar o método apropriado de atribuição de identidade é essencial para gerenciar o acesso e a segurança em várias máquinas virtuais do Azure.",
            "statements": [
                {
                    "title": "uma conta de usuário do Azure AD",
                    "isCorrect": false
                },
                {
                    "title": "uma identidade gerenciada atribuída pelo usuário",
                    "isCorrect": true
                },
                {
                    "title": "uma identidade gerenciada atribuída pelo sistema",
                    "isCorrect": false
                },
                {
                    "title": "um grupo de segurança do Azure AD",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "Os padrões de segurança no Azure AD são projetados para garantir que medidas de segurança aprimoradas, como MFA, sejam aplicadas amplamente e de forma consistente.",
            "statements": [
                {
                    "title": "Os padrões de segurança exigem uma licença do Azure AD Premium.",
                    "isCorrect": false
                },
                {
                    "title": "Os padrões de segurança podem ser habilitados para um único usuário do Azure AD.",
                    "isCorrect": false
                },
                {
                    "title": "Quando os padrões de segurança estão habilitados, todos os administradores devem usar a autenticação multifator (MFA).",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "choose",
            "question": "Quais três formas de verificação podem ser usadas com a Autenticação Multifator (MFA) do Azure AD? Cada resposta correta apresenta uma solução completa.",
            "explanation": "A Autenticação Multifator (MFA) do Azure AD suporta vários métodos de verificação para aumentar a segurança. Estes incluem o aplicativo Microsoft Authenticator, mensagens SMS e Windows Hello para Empresas.",
            "statements": [
                {
                    "title": "perguntas de segurança",
                    "isCorrect": false
                },
                {
                    "title": "o aplicativo Microsoft Authenticator",
                    "isCorrect": true
                },
                {
                    "title": "mensagens SMS",
                    "isCorrect": true
                },
                {
                    "title": "um smart card",
                    "isCorrect": false
                },
                {
                    "title": "Windows Hello para Empresas",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "A redefinição de senha de autoatendimento (SSPR) permite que os usuários redefinam suas senhas usando vários métodos de verificação. Estes incluem notificações para o aplicativo Microsoft Authenticator, mas não endereços de email externos para autenticação.",
            "statements": [
                {
                    "title": "Um endereço de email externo pode ser usado para autenticar a redefinição de senha de autoatendimento (SSPR).",
                    "isCorrect": false
                },
                {
                    "title": "Uma notificação para o aplicativo Microsoft Authenticator pode ser usada para autenticar a redefinição de senha de autoatendimento (SSPR).",
                    "isCorrect": true
                },
                {
                    "title": "Para realizar a redefinição de senha de autoatendimento (SSPR), um usuário deve já estar conectado e autenticado no Azure AD.",
                    "isCorrect": false
                }
            ]
        },        
        {
            "type": "choose",
            "question": "O Microsoft 365 Endpoint data loss prevention (Endpoint DLP) pode ser usado em quais sistemas operacionais?",
            "explanation": "O Endpoint DLP está disponível para Windows 10 e versões mais recentes, Android e macOS.",
            "statements": [
                {
                    "title": "Windows 10 e versões mais recentes apenas",
                    "isCorrect": false
                },
                {
                    "title": "Windows 10 e versões mais recentes e Android apenas",
                    "isCorrect": false
                },
                {
                    "title": "Windows 10 e versões mais recentes e macOS apenas",
                    "isCorrect": false
                },
                {
                    "title": "Windows 10 e versões mais recentes, Android e macOS",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "choose",
            "question": "Você tem uma assinatura do Azure que contém um workspace do Log Analytics. Você precisa iniciar o Microsoft Sentinel. O que você deve fazer primeiro?",
            "explanation": "Conecte-se às suas fontes de segurança para garantir que o Microsoft Sentinel possa começar a ingerir dados de segurança. Fonte: https://learn.microsoft.com/pt-br/azure/sentinel/best-practices-workspace-architecture",
            "statements": [
                {
                    "title": "Criar uma consulta de caça.",
                    "isCorrect": false
                },
                {
                    "title": "Correlacionar alertas em incidentes.",
                    "isCorrect": false
                },
                {
                    "title": "Conectar-se às suas fontes de segurança.",
                    "isCorrect": true
                },
                {
                    "title": "Criar uma regra de detecção personalizada.",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "O Azure DDoS Protection Standard fornece recursos aprimorados de mitigação de DDoS para proteger contra vários tipos de ataques, incluindo ataques de protocolo. Ele não é habilitado por padrão em uma assinatura do Azure. Fonte: https://learn.microsoft.com/pt-br/azure/ddos-protection/ddos-protection-overview",
            "statements": [
                {
                    "title": "O Azure DDoS Protection Standard protege contra ataques man-in-the-middle (MITM).",
                    "isCorrect": false
                },
                {
                    "title": "O Azure DDoS Protection Standard é habilitado por padrão em uma assinatura do Azure.",
                    "isCorrect": false
                },
                {
                    "title": "O Azure DDoS Protection Standard protege contra ataques de protocolo.",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "select",
            "question": "Os recursos ... do Microsoft Defender para Nuvem bloqueiam malware e outros aplicativos indesejados, enquanto reduzem a superfície de ataque na rede em máquinas virtuais do Azure.",
            "explanation": "Os recursos de controle de acesso e aplicação do Microsoft Defender para Nuvem bloqueiam malware e outros aplicativos indesejados, enquanto reduzem a superfície de ataque na rede em máquinas virtuais do Azure. Fonte: https://learn.microsoft.com/pt-br/azure/defender-for-cloud/adaptive-application-controls",
            "statements": [
                {
                    "title": "Controle de acesso e aplicação",
                    "isCorrect": true
                },
                {
                    "title": "Cloud Security Posture Management (CSPM)",
                    "isCorrect": false
                },
                {
                    "title": "segurança de contêiner",
                    "isCorrect": false
                },
                {
                    "title": "avaliação de vulnerabilidades",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "O Microsoft Purview Information Barriers permite a separação de usuários e grupos para evitar comunicação ou colaboração inadequadas. Já o Microsoft Purview Communication Compliance permite escanear arquivos e emails internos e externos para detectar violações de conformidade. Fonte: https://learn.microsoft.com/pt-br/microsoft-365/compliance/communication-compliance-policies?view=o365-worldwide",
            "statements": [
                {
                    "title": "Você pode usar o Microsoft Purview Information Barriers para detectar mensagens que contenham linguagem inadequada.",
                    "isCorrect": false
                },
                {
                    "title": "Você pode usar o Microsoft Purview Communication Compliance para escanear arquivos armazenados no Microsoft SharePoint Online.",
                    "isCorrect": true
                },
                {
                    "title": "Você pode usar o Microsoft Purview Communication Compliance para escanear emails internos e externos no Microsoft Exchange Online.",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "select",
            "question": "O logon único (SSO) configurado entre vários provedores de identidade é um exemplo de...",
            "explanation": "A federação permite que múltiplos provedores de identidade trabalhem juntos para fornecer uma experiência de Single Sign-On (SSO). Fonte: https://learn.microsoft.com/pt-br/azure/active-directory/hybrid/connect/whatis-fed",
            "statements": [
                {
                    "title": "federação",
                    "isCorrect": true
                },
                {
                    "title": "integração",
                    "isCorrect": false
                },
                {
                    "title": "sincronização de hash de senha",
                    "isCorrect": false
                },
                {
                    "title": "autenticação de passagem",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "choose",
            "question": "Você planeja mover recursos para a nuvem. Você está avaliando o uso dos modelos de nuvem Infraestrutura como Serviço (IaaS), Plataforma como Serviço (PaaS) e Software como Serviço (SaaS). Você planeja gerenciar apenas os dados, contas de usuário e dispositivos de usuário para um aplicativo baseado em nuvem. Qual modelo de nuvem você usará?",
            "explanation": "O modelo de Software como Serviço (SaaS) permite que você gerencie apenas dados, contas de usuário e dispositivos de usuário, enquanto o provedor de serviços gerencia o restante. Fonte: https://learn.microsoft.com/pt-br/azure/security/fundamentals/shared-responsibility",
            "statements": [
                {
                    "title": "SaaS",
                    "isCorrect": true
                },
                {
                    "title": "PaaS",
                    "isCorrect": false
                },
                {
                    "title": "IaaS",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "select",
            "question": "Habilitar uma identidade gerenciada atribuída pelo sistema cria um principal de serviço que...",
            "explanation": "Quando você habilita uma identidade gerenciada atribuída pelo sistema, ela é atrelada ao ciclo de vida do recurso que a usa, ou seja, se o recurso for excluído, a identidade também será. Isso facilita a gestão automática da identidade.",
            "statements": [
                {
                    "title": "pode ser compartilhado com vários recursos do Azure.",
                    "isCorrect": false
                },
                {
                    "title": "é gerenciado separadamente do recurso que a utiliza.",
                    "isCorrect": false
                },
                {
                    "title": "está atrelado ao ciclo de vida do recurso que a utiliza.",
                    "isCorrect": true
                },
                {
                    "title": "deve ser registrado manualmente no Azure AD.",
                    "isCorrect": false
                }
            ]
        },        
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "A identidade de dispositivo pode ser armazenada no Azure AD. Uma única identidade gerenciada atribuída pelo sistema não pode ser usada por vários recursos do Azure. Se você excluir um recurso do Azure que tem uma identidade gerenciada atribuída pelo usuário, a identidade gerenciada não é excluída automaticamente. Fonte: https://learn.microsoft.com/pt-br/azure/active-directory/managed-identities-azure-resources/overview",
            "statements": [
                {
                    "title": "A identidade de dispositivo pode ser armazenada no Azure AD.",
                    "isCorrect": true
                },
                {
                    "title": "Uma única identidade gerenciada atribuída pelo sistema pode ser usada por vários recursos do Azure.",
                    "isCorrect": false
                },
                {
                    "title": "Se você excluir um recurso do Azure que tem uma identidade gerenciada atribuída pelo usuário, a identidade gerenciada é excluída automaticamente.",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "choose",
            "question": "Qual pontuação mede o progresso de uma organização em concluir ações que ajudam a reduzir riscos associados à proteção de dados e padrões regulatórios?",
            "explanation": "A pontuação de conformidade mede o progresso de uma organização em concluir ações que ajudam a reduzir os riscos associados à proteção de dados e padrões regulatórios. Fonte: https://learn.microsoft.com/pt-br/purview/compliance-score-calculation",
            "statements": [
                {
                    "title": "Pontuação de adoção",
                    "isCorrect": false
                },
                {
                    "title": "Pontuação de segurança da Microsoft",
                    "isCorrect": false
                },
                {
                    "title": "Pontuação de segurança no Microsoft Defender para Nuvem",
                    "isCorrect": false
                },
                {
                    "title": "Pontuação de conformidade",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
            "explanation": "O GitHub pode ser usado como um provedor de identidade baseado na nuvem. A federação fornece Single Sign-On (SSO) com múltiplos provedores de serviço. Um provedor de identidade central não gerencia todos os serviços de autenticação modernos, como autenticação, autorização e auditoria.",
            "statements": [
                {
                    "title": "O GitHub é um provedor de identidade baseado na nuvem.",
                    "isCorrect": true
                },
                {
                    "title": "A federação fornece logon único (SSO) com vários provedores de serviço.",
                    "isCorrect": true
                },
                {
                    "title": "Um provedor de identidade central gerencia todos os serviços de autenticação modernos, como autenticação, autorização e auditoria.",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "multiple-select",
            "question": [
                "Revisar e filtrar alertas",
                "Criar casos no painel de Casos",
                "Enviar um lembrete das políticas corporativas aos usuários"
            ],            
            "explanation": "",
            "statements": [
                {
                    "title": "Ação",
                    "isCorrect": true
                },
                {
                    "title": "Investigar",
                    "isCorrect": true
                },
                {
                    "title": "Triagem",
                    "isCorrect": true
                }
            ],
            "answers": [
                "Triagem",
                "Investigar",
                "Ação"
            ]
        },
        {
            "type": "choose",
            "question": "O que você deve usar no portal do Microsoft 365 Defender para visualizar tendências de segurança e acompanhar o status de proteção das identidades?",
            "explanation": "",
            "statements": [
                {
                    "title": "Relatórios",
                    "isCorrect": true
                },
                {
                    "title": "Incidentes",
                    "isCorrect": false
                },
                {
                    "title": "Caça",
                    "isCorrect": false
                },
                {
                    "title": "Pontuação de segurança",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "choose",
            "question": "Você tem uma assinatura do Azure. Você precisa implementar a ativação de função com base em aprovação e com limite de tempo. O que você deve usar?",
            "explanation": "O Azure AD Privileged Identity Management (PIM) permite a ativação baseada em aprovação e com limite de tempo para funções de administração no Azure AD, além de fornecer relatórios e alertas para monitorar o acesso privilegiado. Essa funcionalidade é essencial para ajudar a minimizar os riscos associados ao acesso privilegiado concedido por longos períodos.",
            "statements": [
                {
                    "title": "revisões de acesso no Azure AD",
                    "isCorrect": false
                },
                {
                    "title": "Azure AD Privileged Identity Management (PIM)",
                    "isCorrect": true
                },
                {
                    "title": "Proteção de identidade do Azure AD",
                    "isCorrect": false
                },
                {
                    "title": "Acesso condicional no Azure AD",
                    "isCorrect": false
                }
            ]
        },
        {
            "type": "multiple-YesNo",
            "question": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não. NOTA: Cada seleção correta vale um ponto.",
            "explanation": "As barreiras de informação (IB) podem ser usadas para restringir a comunicação e a colaboração nos serviços do Microsoft 365 para cumprir as regulamentações do setor e as políticas organizacionais. Elas são usadas no Exchange Online, SharePoint Online e Microsoft Teams para vários fins de conformidade.",
            "statements": [
                {
                    "title": "Você pode restringir a comunicação entre usuários no Exchange Online usando barreiras de informação.",
                    "isCorrect": true
                },
                {
                    "title": "Você pode restringir o acesso a um site do SharePoint Online usando barreiras de informação.",
                    "isCorrect": true
                },
                {
                    "title": "Você pode impedir o compartilhamento de um arquivo com outro usuário no Microsoft Teams usando barreiras de informação.",
                    "isCorrect": true
                }
            ]
        },
        {
            "type": "select",
            "question": "No portal de conformidade Microsoft Purview, você pode usar ... para remover recursos do painel de navegação.",
            "explanation": "No portal de conformidade Microsoft Purview, a opção 'Customize navigation' permite que você personalize e remova recursos do painel de navegação, ajudando a simplificar a interface de acordo com as necessidades da sua organização.",
            "statements": [
                {
                    "title": "Compliance Manager",
                    "isCorrect": false
                },
                {
                    "title": "Customize navigation",
                    "isCorrect": true
                },
                {
                    "title": "Políticas",
                    "isCorrect": false
                },
                {
                    "title": "Configurações",
                    "isCorrect": false
                }
            ]
        }        
    ]
}
